sergev/qemu/hw/mips/mips_pic32mz.c
/*
 * QEMU support for Microchip PIC32MZ microcontroller.
 *
 * Copyright (c) 2015 Serge Vakulenko
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL
 * THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

/* Only 32-bit little endian mode supported. */
#include "config.h"
#if !defined TARGET_MIPS64 && !defined TARGET_WORDS_BIGENDIAN

#include "hw/i386/pc.h"
#include "hw/char/serial.h"
#include "hw/mips/cpudevs.h"
#include "sysemu/char.h"
#include "hw/loader.h"
#include "qemu/error-report.h"
#include "hw/empty_slot.h"
#include <termios.h>

#include "pic32mz.h"
#include "pic32_peripherals.h"

/* Hardware addresses */
#define PROGRAM_FLASH_START 0x1d000000
#define BOOT_FLASH_START    0x1fc00000
#define DATA_MEM_START      0x00000000
#define IO_MEM_START        0x1f800000

#define PROGRAM_FLASH_SIZE  (2*1024*1024)       // 2 Mbytes
#define BOOT_FLASH_SIZE     (64*1024)           // 64 kbytes
#define DATA_MEM_SIZE       (512*1024)          // 512 kbytes

#define TYPE_MIPS_PIC32     "mips-pic32mz"

/*
 * Board variants.
 */
enum {
    BOARD_WIFIRE,           /* chipKIT WiFire board */
    BOARD_MEBII,            /* Microchip MEB-II board */
    BOARD_EXPLORER16,       /* Microchip Explorer-16 board */
};

static const char *board_name[] = {
    "chipKIT WiFire",
    "Microchip MEB-II",
    "Microchip Explorer16",
};

/*
 * Pointers to Flash memory contents.
 */
static char *prog_ptr;
static char *boot_ptr;

#define BOOTMEM(addr) ((uint32_t*) boot_ptr) [(addr & 0xffff) >> 2]

/*
 * TODO: add option to enable tracing.
 */
#define TRACE   0

static void update_irq_status(pic32_t *s)
{
    /* Assume no interrupts pending. */
    int cause_ripl = 0;
    int vector = 0;
    CPUMIPSState *env = &s->cpu->env;
    int current_ripl = (env->CP0_Cause >> (CP0Ca_IP + 2)) & 0x3f;

    VALUE(INTSTAT) = 0;

    if ((VALUE(IFS0) & VALUE(IEC0)) ||
        (VALUE(IFS1) & VALUE(IEC1)) ||
        (VALUE(IFS2) & VALUE(IEC2)) ||
        (VALUE(IFS3) & VALUE(IEC3)) ||
        (VALUE(IFS4) & VALUE(IEC4)) ||
        (VALUE(IFS5) & VALUE(IEC5)))
    {
        /* Find the most prioritive pending interrupt,
         * it's vector and level. */
        int irq;
        for (irq=0; irq<=PIC32_IRQ_LAST; irq++) {
            int n = irq >> 5;

            if (((VALUE(IFS(n)) & VALUE(IEC(n))) >> (irq & 31)) & 1) {
                /* Interrupt is pending. */
                int level = VALUE(IPC(irq >> 2));
                level >>= 2 + (irq & 3) * 8;
                level &= 7;
                if (level > cause_ripl) {
                    vector = irq;
                    cause_ripl = level;
                }
            }
        }
        VALUE(INTSTAT) = vector | (cause_ripl << 8);
    }

    if (cause_ripl == current_ripl)
        return;

    if (TRACE)
        fprintf(qemu_logfile, "--- Priority level Cause.RIPL = %u\n",
            cause_ripl);

    /*
     * Modify Cause.RIPL field and take EIC interrupt.
     */
    env->CP0_Cause &= ~(0x3f << (CP0Ca_IP + 2));
    env->CP0_Cause |= cause_ripl << (CP0Ca_IP + 2);
    cpu_interrupt(CPU(s->cpu), CPU_INTERRUPT_HARD);
}

/*
 * Set interrupt flag status
 */
static void irq_raise(pic32_t *s, int irq)
{
    if (VALUE(IFS(irq >> 5)) & (1 << (irq & 31)))
        return;

    VALUE(IFS(irq >> 5)) |= 1 << (irq & 31);
    update_irq_status(s);
}

/*
 * Clear interrupt flag status
 */
static void irq_clear(pic32_t *s, int irq)
{
    if (! (VALUE(IFS(irq >> 5)) & (1 << (irq & 31))))
        return;

    VALUE(IFS(irq >> 5)) &= ~(1 << (irq & 31));
    update_irq_status(s);
}

/*
 * Timer interrupt.
 */
static void pic32_timer_irq(CPUMIPSState *env, int raise)
{
    pic32_t *s = env->eic_context;

    if (raise) {
        if (TRACE)
            fprintf(qemu_logfile, "--- %08x: Timer interrupt\n",
                env->active_tc.PC);
        irq_raise(s, 0);
    } else {
        if (TRACE)
            fprintf(qemu_logfile, "--- Clear timer interrupt\n");
        irq_clear(s, 0);
    }
}

/*
 * Software interrupt.
 */
static void pic32_soft_irq(CPUMIPSState *env, int num)
{
    pic32_t *s = env->eic_context;

    if (TRACE)
        fprintf(qemu_logfile, "--- %08x: Soft interrupt %u\n",
            env->active_tc.PC, num);
    irq_raise(s, num + 1);
}

/*
 * Perform an assign/clear/set/invert operation.
 */
static inline unsigned write_op(int a, int b, int op)
{
    switch (op & 0xc) {
    case 0x0: a = b;   break;   // Assign
    case 0x4: a &= ~b; break;   // Clear
    case 0x8: a |= b;  break;   // Set
    case 0xc: a ^= b;  break;   // Invert
    }
    return a;
}

static void io_reset(pic32_t *s)
{
    int i;

    /*
     * Prefetch controller.
     */
    VALUE(PRECON) = 0x00000007;

    /*
     * System controller.
     */
    s->syskey_unlock = 0;
    VALUE(CFGCON) = PIC32_CFGCON_ECC_DISWR | PIC32_CFGCON_TDOEN;
    VALUE(SYSKEY) = 0;
    VALUE(RCON)   = 0;
    VALUE(RSWRST) = 0;
    VALUE(OSCTUN) = 0;
    VALUE(SPLLCON)= 0x01310201;
    VALUE(PB1DIV) = 0x00008801;
    VALUE(PB2DIV) = 0x00008801;
    VALUE(PB3DIV) = 0x00008801;
    VALUE(PB4DIV) = 0x00008801;
    VALUE(PB5DIV) = 0x00008801;
    VALUE(PB7DIV) = 0x00008800;
    VALUE(PB8DIV) = 0x00008801;

