sergev/qemu/hw/mips/mips_pic32mz.c
    /*
     * General purpose IO signals.
     * All pins are inputs, high, open drains and pullups disabled.
     * No interrupts on change.
     */
    VALUE(ANSELA) = 0xFFFF;             // Port A: analog select
    VALUE(TRISA) = 0xFFFF;              // Port A: mask of inputs
    VALUE(PORTA) = 0xFFCF;              // Port A: read inputs, write outputs
    VALUE(LATA)  = 0xFFFF;              // Port A: read/write outputs
    VALUE(ODCA)  = 0;                   // Port A: open drain configuration
    VALUE(CNPUA) = 0;                   // Input pin pull-up
    VALUE(CNPDA) = 0;                   // Input pin pull-down
    VALUE(CNCONA) = 0;                  // Interrupt-on-change control
    VALUE(CNENA) = 0;                   // Input change interrupt enable
    VALUE(CNSTATA) = 0;                 // Input change status

    VALUE(ANSELB) = 0xFFFF;             // Port B: analog select
    VALUE(TRISB) = 0xFFFF;              // Port B: mask of inputs
    VALUE(PORTB) = 0xFFFF;              // Port B: read inputs, write outputs
    if (s->board_type == BOARD_MEBII)
        VALUE(PORTB) ^= 1 << 12;        // Disable pin RB12 - button 1
    VALUE(LATB)  = 0xFFFF;              // Port B: read/write outputs
    VALUE(ODCB)  = 0;                   // Port B: open drain configuration
    VALUE(CNPUB) = 0;                   // Input pin pull-up
    VALUE(CNPDB) = 0;                   // Input pin pull-down
    VALUE(CNCONB) = 0;                  // Interrupt-on-change control
    VALUE(CNENB) = 0;                   // Input change interrupt enable
    VALUE(CNSTATB) = 0;                 // Input change status

    VALUE(ANSELC) = 0xFFFF;             // Port C: analog select
    VALUE(TRISC) = 0xFFFF;              // Port C: mask of inputs
    VALUE(PORTC) = 0xFFFF;              // Port C: read inputs, write outputs
    VALUE(LATC)  = 0xFFFF;              // Port C: read/write outputs
    if (s->board_type == BOARD_WIFIRE)
        VALUE(LATC) ^= 0x1000;          // Disable latc[15] for the chipKIT bootloader
    VALUE(ODCC)  = 0;                   // Port C: open drain configuration
    VALUE(CNPUC) = 0;                   // Input pin pull-up
    VALUE(CNPDC) = 0;                   // Input pin pull-down
    VALUE(CNCONC) = 0;                  // Interrupt-on-change control
    VALUE(CNENC) = 0;                   // Input change interrupt enable
    VALUE(CNSTATC) = 0;                 // Input change status

    VALUE(ANSELD) = 0xFFFF;             // Port D: analog select
    VALUE(TRISD) = 0xFFFF;              // Port D: mask of inputs
    VALUE(PORTD) = 0xFFFF;              // Port D: read inputs, write outputs
    VALUE(LATD)  = 0xFFFF;              // Port D: read/write outputs
    VALUE(ODCD)  = 0;                   // Port D: open drain configuration
    VALUE(CNPUD) = 0;                   // Input pin pull-up
    VALUE(CNPDD) = 0;                   // Input pin pull-down
    VALUE(CNCOND) = 0;                  // Interrupt-on-change control
    VALUE(CNEND) = 0;                   // Input change interrupt enable
    VALUE(CNSTATD) = 0;                 // Input change status

    VALUE(ANSELE) = 0xFFFF;             // Port E: analog select
    VALUE(TRISE) = 0xFFFF;              // Port E: mask of inputs
    VALUE(PORTE) = 0xFFFF;              // Port E: read inputs, write outputs
    VALUE(LATE)  = 0xFFFF;              // Port E: read/write outputs
    VALUE(ODCE)  = 0;                   // Port E: open drain configuration
    VALUE(CNPUE) = 0;                   // Input pin pull-up
    VALUE(CNPDE) = 0;                   // Input pin pull-down
    VALUE(CNCONE) = 0;                  // Interrupt-on-change control
    VALUE(CNENE) = 0;                   // Input change interrupt enable
    VALUE(CNSTATE) = 0;                 // Input change status

    VALUE(ANSELF) = 0xFFFF;             // Port F: analog select
    VALUE(TRISF) = 0xFFFF;              // Port F: mask of inputs
    VALUE(PORTF) = 0xFFFF;              // Port F: read inputs, write outputs
    VALUE(LATF)  = 0xFFFF;              // Port F: read/write outputs
    VALUE(ODCF)  = 0;                   // Port F: open drain configuration
    VALUE(CNPUF) = 0;                   // Input pin pull-up
    VALUE(CNPDF) = 0;                   // Input pin pull-down
    VALUE(CNCONF) = 0;                  // Interrupt-on-change control
    VALUE(CNENF) = 0;                   // Input change interrupt enable
    VALUE(CNSTATF) = 0;                 // Input change status

    VALUE(ANSELG) = 0xFFFF;             // Port G: analog select
    VALUE(TRISG) = 0xFFFF;              // Port G: mask of inputs
    VALUE(PORTG) = 0xFFFF;              // Port G: read inputs, write outputs
    VALUE(LATG)  = 0xFFFF;              // Port G: read/write outputs
    VALUE(ODCG)  = 0;                   // Port G: open drain configuration
    VALUE(CNPUG) = 0;                   // Input pin pull-up
    VALUE(CNPDG) = 0;                   // Input pin pull-down
    VALUE(CNCONG) = 0;                  // Interrupt-on-change control
    VALUE(CNENG) = 0;                   // Input change interrupt enable
    VALUE(CNSTATG) = 0;                 // Input change status

    VALUE(ANSELH) = 0xFFFF;             // Port H: analog select
    VALUE(TRISH) = 0xFFFF;              // Port H: mask of inputs
    VALUE(PORTH) = 0xFFFF;              // Port H: read inputs, write outputs
    VALUE(LATH)  = 0xFFFF;              // Port H: read/write outputs
    VALUE(ODCH)  = 0;                   // Port H: open drain configuration
    VALUE(CNPUH) = 0;                   // Input pin pull-up
    VALUE(CNPDH) = 0;                   // Input pin pull-down
    VALUE(CNCONH) = 0;                  // Interrupt-on-change control
    VALUE(CNENH) = 0;                   // Input change interrupt enable
    VALUE(CNSTATH) = 0;                 // Input change status

    VALUE(ANSELJ) = 0xFFFF;             // Port J: analog select
    VALUE(TRISJ) = 0xFFFF;              // Port J: mask of inputs
    VALUE(PORTJ) = 0xFFFF;              // Port J: read inputs, write outputs
    VALUE(LATJ)  = 0xFFFF;              // Port J: read/write outputs
    VALUE(ODCJ)  = 0;                   // Port J: open drain configuration
    VALUE(CNPUJ) = 0;                   // Input pin pull-up
    VALUE(CNPDJ) = 0;                   // Input pin pull-down
    VALUE(CNCONJ) = 0;                  // Interrupt-on-change control
    VALUE(CNENJ) = 0;                   // Input change interrupt enable
    VALUE(CNSTATJ) = 0;                 // Input change status

    VALUE(TRISK) = 0xFFFF;              // Port K: mask of inputs
    VALUE(PORTK) = 0xFFFF;              // Port K: read inputs, write outputs
    VALUE(LATK)  = 0xFFFF;              // Port K: read/write outputs
    VALUE(ODCK)  = 0;                   // Port K: open drain configuration
    VALUE(CNPUK) = 0;                   // Input pin pull-up
    VALUE(CNPDK) = 0;                   // Input pin pull-down
    VALUE(CNCONK) = 0;                  // Interrupt-on-change control
    VALUE(CNENK) = 0;                   // Input change interrupt enable
    VALUE(CNSTATK) = 0;                 // Input change status

