sergev/qemu/hw/mips/mips_pic32mz.c
    /*
     * Reset UARTs.
     */
    VALUE(U1MODE)  = 0;
    VALUE(U1STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U1TXREG) = 0;
    VALUE(U1RXREG) = 0;
    VALUE(U1BRG)   = 0;
    VALUE(U2MODE)  = 0;
    VALUE(U2STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U2TXREG) = 0;
    VALUE(U2RXREG) = 0;
    VALUE(U2BRG)   = 0;
    VALUE(U3MODE)  = 0;
    VALUE(U3STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U3TXREG) = 0;
    VALUE(U3RXREG) = 0;
    VALUE(U3BRG)   = 0;
    VALUE(U4MODE)  = 0;
    VALUE(U4STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U4TXREG) = 0;
    VALUE(U4RXREG) = 0;
    VALUE(U4BRG)   = 0;
    VALUE(U5MODE)  = 0;
    VALUE(U5STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U5TXREG) = 0;
    VALUE(U5RXREG) = 0;
    VALUE(U5BRG)   = 0;
    VALUE(U6MODE)  = 0;
    VALUE(U6STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U6TXREG) = 0;
    VALUE(U6RXREG) = 0;
    VALUE(U6BRG)   = 0;

    /*
     * Reset SPI.
     */
    VALUE(SPI1CON)  = 0;
    VALUE(SPI1STAT) = PIC32_SPISTAT_SPITBE;     // Transmit buffer is empty
    VALUE(SPI1BRG)  = 0;

    VALUE(SPI2CON)  = 0;
    VALUE(SPI2STAT) = PIC32_SPISTAT_SPITBE;     // Transmit buffer is empty
    VALUE(SPI2BRG)  = 0;

    VALUE(SPI3CON)  = 0;
    VALUE(SPI3STAT) = PIC32_SPISTAT_SPITBE;     // Transmit buffer is empty
    VALUE(SPI3BRG)  = 0;

    VALUE(SPI4CON)  = 0;
    VALUE(SPI4STAT) = PIC32_SPISTAT_SPITBE;     // Transmit buffer is empty
    VALUE(SPI4BRG)  = 0;

    VALUE(SPI5CON)  = 0;
    VALUE(SPI5STAT) = PIC32_SPISTAT_SPITBE;     // Transmit buffer is empty
    VALUE(SPI5BRG)  = 0;

    VALUE(SPI6CON)  = 0;
    VALUE(SPI6STAT) = PIC32_SPISTAT_SPITBE;     // Transmit buffer is empty
    VALUE(SPI6BRG)  = 0;

    VALUE(SPI1CON2) = 0;
    VALUE(SPI2CON2) = 0;
    VALUE(SPI3CON2) = 0;
    VALUE(SPI4CON2) = 0;
    VALUE(SPI5CON2) = 0;
    VALUE(SPI6CON2) = 0;

    for (i=0; i<NUM_SPI; i++) {
        s->spi[i].rfifo = 0;
        s->spi[i].wfifo = 0;
    }

    /*
     * Reset timers.
     */
    VALUE(T1CON)    = 0;
    VALUE(TMR1)     = 0;
    VALUE(PR1)      = 0xffff;
    VALUE(T2CON)    = 0;
    VALUE(TMR2)     = 0;
    VALUE(PR2)      = 0xffff;
    VALUE(T3CON)    = 0;
    VALUE(TMR3)     = 0;
    VALUE(PR3)      = 0xffff;
    VALUE(T4CON)    = 0;
    VALUE(TMR4)     = 0;
    VALUE(PR4)      = 0xffff;
    VALUE(T5CON)    = 0;
    VALUE(TMR5)     = 0;
    VALUE(PR5)      = 0xffff;
    VALUE(T6CON)    = 0;
    VALUE(TMR6)     = 0;
    VALUE(PR6)      = 0xffff;
    VALUE(T7CON)    = 0;
    VALUE(TMR7)     = 0;
    VALUE(PR7)      = 0xffff;
    VALUE(T8CON)    = 0;
    VALUE(TMR8)     = 0;
    VALUE(PR8)      = 0xffff;
    VALUE(T9CON)    = 0;
    VALUE(TMR9)     = 0;
    VALUE(PR9)      = 0xffff;

    /*
     * Reset Ethernet.
     */
    VALUE(ETHCON1)      = 0;        // Control 1
    VALUE(ETHCON2)      = 0;        // Control 2: RX data buffer size
    VALUE(ETHTXST)      = 0;        // Tx descriptor start address
    VALUE(ETHRXST)      = 0;        // Rx descriptor start address
    VALUE(ETHHT0)       = 0;        // Hash tasble 0
    VALUE(ETHHT1)       = 0;        // Hash tasble 1
    VALUE(ETHPMM0)      = 0;        // Pattern match mask 0
    VALUE(ETHPMM1)      = 0;        // Pattern match mask 1
    VALUE(ETHPMCS)      = 0;        // Pattern match checksum
    VALUE(ETHPMO)       = 0;        // Pattern match offset
    VALUE(ETHRXFC)      = 0;        // Receive filter configuration
    VALUE(ETHRXWM)      = 0;        // Receive watermarks
    VALUE(ETHIEN)       = 0;        // Interrupt enable
    VALUE(ETHIRQ)       = 0;        // Interrupt request
    VALUE(ETHSTAT)      = 0;        // Status
    VALUE(ETHRXOVFLOW)  = 0;        // Receive overflow statistics
    VALUE(ETHFRMTXOK)   = 0;        // Frames transmitted OK statistics
    VALUE(ETHSCOLFRM)   = 0;        // Single collision frames statistics
    VALUE(ETHMCOLFRM)   = 0;        // Multiple collision frames statistics
    VALUE(ETHFRMRXOK)   = 0;        // Frames received OK statistics
    VALUE(ETHFCSERR)    = 0;        // Frame check sequence error statistics
    VALUE(ETHALGNERR)   = 0;        // Alignment errors statistics
    VALUE(EMAC1CFG1)    = 0x800d;   // MAC configuration 1
    VALUE(EMAC1CFG2)    = 0x4082;   // MAC configuration 2
    VALUE(EMAC1IPGT)    = 0x0012;   // MAC back-to-back interpacket gap
    VALUE(EMAC1IPGR)    = 0x0c12;   // MAC non-back-to-back interpacket gap
    VALUE(EMAC1CLRT)    = 0x370f;   // MAC collision window/retry limit
    VALUE(EMAC1MAXF)    = 0x05ee;   // MAC maximum frame length
    VALUE(EMAC1SUPP)    = 0x1000;   // MAC PHY support
    VALUE(EMAC1TEST)    = 0;        // MAC test
    VALUE(EMAC1MCFG)    = 0x0020;   // MII configuration
    VALUE(EMAC1MCMD)    = 0;        // MII command
    VALUE(EMAC1MADR)    = 0x0100;   // MII address
    VALUE(EMAC1MWTD)    = 0;        // MII write data
    VALUE(EMAC1MRDD)    = 0;        // MII read data
    VALUE(EMAC1MIND)    = 0;        // MII indicators
    VALUE(EMAC1SA0)     = 0x79c1;   // MAC station address 0
    VALUE(EMAC1SA1)     = 0xcbc0;   // MAC station address 1
    VALUE(EMAC1SA2)     = 0x1e00;   // MAC station address 2

    /*
     * Reset USB.
     */
    VALUE(USBCSR0)      = 0x2000;
    VALUE(USBCSR1)      = 0x00ff0000;
    VALUE(USBCSR2)      = 0x060000fe;
    VALUE(USBCSR3)      = 0;
    VALUE(USBIENCSR0)   = 0;
    VALUE(USBIENCSR1)   = 0;
    VALUE(USBIENCSR2)   = 0;
    VALUE(USBIENCSR3)   = 0;
    VALUE(USBFIFO0)     = 0;
    VALUE(USBFIFO1)     = 0;
    VALUE(USBFIFO2)     = 0;
    VALUE(USBFIFO3)     = 0;
    VALUE(USBFIFO4)     = 0;
    VALUE(USBFIFO5)     = 0;
    VALUE(USBFIFO6)     = 0;
    VALUE(USBFIFO7)     = 0;
    VALUE(USBOTG)       = 0x0080;
    VALUE(USBFIFOA)     = 0;
    VALUE(USBHWVER)     = 0x0800;
    VALUE(USBINFO)      = 0x3C5C8C77;
    VALUE(USBEOFRST)    = 0x00727780;
    VALUE(USBE0TXA)     = 0;
    VALUE(USBE0RXA)     = 0;
    VALUE(USBE1TXA)     = 0;
    VALUE(USBE1RXA)     = 0;
    VALUE(USBE2TXA)     = 0;
    VALUE(USBE2RXA)     = 0;
    VALUE(USBE3TXA)     = 0;
    VALUE(USBE3RXA)     = 0;
    VALUE(USBE4TXA)     = 0;
    VALUE(USBE4RXA)     = 0;
    VALUE(USBE5TXA)     = 0;
    VALUE(USBE5RXA)     = 0;
    VALUE(USBE6TXA)     = 0;
    VALUE(USBE6RXA)     = 0;
    VALUE(USBE7TXA)     = 0;
    VALUE(USBE7RXA)     = 0;
    VALUE(USBE0CSR0)    = 0;
    VALUE(USBE0CSR2)    = 0;
    VALUE(USBE0CSR3)    = 0;
    VALUE(USBE1CSR0)    = 0;
    VALUE(USBE1CSR1)    = 0;
    VALUE(USBE1CSR2)    = 0;
    VALUE(USBE1CSR3)    = 0;
    VALUE(USBE2CSR0)    = 0;
    VALUE(USBE2CSR1)    = 0;
    VALUE(USBE2CSR2)    = 0;
    VALUE(USBE2CSR3)    = 0;
    VALUE(USBE3CSR0)    = 0;
    VALUE(USBE3CSR1)    = 0;
    VALUE(USBE3CSR2)    = 0;
    VALUE(USBE3CSR3)    = 0;
    VALUE(USBE4CSR0)    = 0;
    VALUE(USBE4CSR1)    = 0;
    VALUE(USBE4CSR2)    = 0;
    VALUE(USBE4CSR3)    = 0;
    VALUE(USBE5CSR0)    = 0;
    VALUE(USBE5CSR1)    = 0;
    VALUE(USBE5CSR2)    = 0;
    VALUE(USBE5CSR3)    = 0;
    VALUE(USBE6CSR0)    = 0;
    VALUE(USBE6CSR1)    = 0;
    VALUE(USBE6CSR2)    = 0;
    VALUE(USBE6CSR3)    = 0;
    VALUE(USBE7CSR0)    = 0;
    VALUE(USBE7CSR1)    = 0;
    VALUE(USBE7CSR2)    = 0;
    VALUE(USBE7CSR3)    = 0;
    VALUE(USBDMAINT)    = 0;
    VALUE(USBDMA1C)     = 0;
    VALUE(USBDMA1A)     = 0;
    VALUE(USBDMA1N)     = 0;
    VALUE(USBDMA2C)     = 0;
    VALUE(USBDMA2A)     = 0;
    VALUE(USBDMA2N)     = 0;
    VALUE(USBDMA3C)     = 0;
    VALUE(USBDMA3A)     = 0;
    VALUE(USBDMA3N)     = 0;
    VALUE(USBDMA4C)     = 0;
    VALUE(USBDMA4A)     = 0;
    VALUE(USBDMA4N)     = 0;
    VALUE(USBDMA5C)     = 0;
    VALUE(USBDMA5A)     = 0;
    VALUE(USBDMA5N)     = 0;
    VALUE(USBDMA6C)     = 0;
    VALUE(USBDMA6A)     = 0;
    VALUE(USBDMA6N)     = 0;
    VALUE(USBDMA7C)     = 0;
    VALUE(USBDMA7A)     = 0;
    VALUE(USBDMA7N)     = 0;
    VALUE(USBDMA8C)     = 0;
    VALUE(USBDMA8A)     = 0;
    VALUE(USBDMA8N)     = 0;
    VALUE(USBE1RPC)     = 0;
    VALUE(USBE2RPC)     = 0;
    VALUE(USBE3RPC)     = 0;
    VALUE(USBE4RPC)     = 0;
    VALUE(USBE5RPC)     = 0;
    VALUE(USBE6RPC)     = 0;
    VALUE(USBE7RPC)     = 0;
    VALUE(USBDPBFD)     = 0;
    VALUE(USBTMCON1)    = 0x05E64074;
    VALUE(USBTMCON2)    = 0;
    VALUE(USBLPMR1)     = 0;
    VALUE(USBLMPR2)     = 0;
}

static unsigned io_read32(pic32_t *s, unsigned offset, const char **namep)
{
    unsigned *bufp = &VALUE(offset);

    switch (offset) {
    /*-------------------------------------------------------------------------
     * Interrupt controller registers.
     */
    STORAGE(INTCON); break;     // Interrupt Control
    STORAGE(INTSTAT); break;    // Interrupt Status
    STORAGE(IFS0); break;       // IFS(0..2) - Interrupt Flag Status
    STORAGE(IFS1); break;
    STORAGE(IFS2); break;
    STORAGE(IFS3); break;
    STORAGE(IFS4); break;
    STORAGE(IFS5); break;
    STORAGE(IEC0); break;       // IEC(0..2) - Interrupt Enable Control
    STORAGE(IEC1); break;
    STORAGE(IEC2); break;
    STORAGE(IEC3); break;
    STORAGE(IEC4); break;
    STORAGE(IEC5); break;

    // IPC(0..11) - Interrupt Priority Control
    STORAGE(IPC0); break;       STORAGE(IPC1); break;
    STORAGE(IPC2); break;       STORAGE(IPC3); break;
    STORAGE(IPC4); break;       STORAGE(IPC5); break;
    STORAGE(IPC6); break;       STORAGE(IPC7); break;
    STORAGE(IPC8); break;       STORAGE(IPC9); break;
    STORAGE(IPC10); break;      STORAGE(IPC11); break;
    STORAGE(IPC12); break;      STORAGE(IPC13); break;
    STORAGE(IPC14); break;      STORAGE(IPC15); break;
    STORAGE(IPC16); break;      STORAGE(IPC17); break;
    STORAGE(IPC18); break;      STORAGE(IPC19); break;
    STORAGE(IPC20); break;      STORAGE(IPC21); break;
    STORAGE(IPC22); break;      STORAGE(IPC23); break;
    STORAGE(IPC24); break;      STORAGE(IPC25); break;
    STORAGE(IPC26); break;      STORAGE(IPC27); break;
    STORAGE(IPC28); break;      STORAGE(IPC29); break;
    STORAGE(IPC30); break;      STORAGE(IPC31); break;
    STORAGE(IPC32); break;      STORAGE(IPC33); break;
    STORAGE(IPC34); break;      STORAGE(IPC35); break;
    STORAGE(IPC36); break;      STORAGE(IPC37); break;
    STORAGE(IPC38); break;      STORAGE(IPC39); break;
    STORAGE(IPC40); break;      STORAGE(IPC41); break;
    STORAGE(IPC42); break;      STORAGE(IPC43); break;
    STORAGE(IPC44); break;      STORAGE(IPC45); break;
    STORAGE(IPC46); break;      STORAGE(IPC47); break;

    // OFF000..OFF190 - Interrupt Vector Address Offset
    STORAGE(OFF(0)); break;     STORAGE(OFF(1)); break;
    STORAGE(OFF(2)); break;     STORAGE(OFF(3)); break;
    STORAGE(OFF(4)); break;     STORAGE(OFF(5)); break;
    STORAGE(OFF(6)); break;     STORAGE(OFF(7)); break;
    STORAGE(OFF(8)); break;     STORAGE(OFF(9)); break;
    STORAGE(OFF(10)); break;    STORAGE(OFF(11)); break;
    STORAGE(OFF(12)); break;    STORAGE(OFF(13)); break;
    STORAGE(OFF(14)); break;    STORAGE(OFF(15)); break;
    STORAGE(OFF(16)); break;    STORAGE(OFF(17)); break;
    STORAGE(OFF(18)); break;    STORAGE(OFF(19)); break;
    STORAGE(OFF(20)); break;    STORAGE(OFF(21)); break;
    STORAGE(OFF(22)); break;    STORAGE(OFF(23)); break;
    STORAGE(OFF(24)); break;    STORAGE(OFF(25)); break;
    STORAGE(OFF(26)); break;    STORAGE(OFF(27)); break;
    STORAGE(OFF(28)); break;    STORAGE(OFF(29)); break;
    STORAGE(OFF(30)); break;    STORAGE(OFF(31)); break;
    STORAGE(OFF(32)); break;    STORAGE(OFF(33)); break;
    STORAGE(OFF(34)); break;    STORAGE(OFF(35)); break;
    STORAGE(OFF(36)); break;    STORAGE(OFF(37)); break;
    STORAGE(OFF(38)); break;    STORAGE(OFF(39)); break;
    STORAGE(OFF(40)); break;    STORAGE(OFF(41)); break;
    STORAGE(OFF(42)); break;    STORAGE(OFF(43)); break;
    STORAGE(OFF(44)); break;    STORAGE(OFF(45)); break;
    STORAGE(OFF(46)); break;    STORAGE(OFF(47)); break;
    STORAGE(OFF(48)); break;    STORAGE(OFF(49)); break;
    STORAGE(OFF(50)); break;    STORAGE(OFF(51)); break;
    STORAGE(OFF(52)); break;    STORAGE(OFF(53)); break;
    STORAGE(OFF(54)); break;    STORAGE(OFF(55)); break;
    STORAGE(OFF(56)); break;    STORAGE(OFF(57)); break;
    STORAGE(OFF(58)); break;    STORAGE(OFF(59)); break;
    STORAGE(OFF(60)); break;    STORAGE(OFF(61)); break;
    STORAGE(OFF(62)); break;    STORAGE(OFF(63)); break;
    STORAGE(OFF(64)); break;    STORAGE(OFF(65)); break;
    STORAGE(OFF(66)); break;    STORAGE(OFF(67)); break;
    STORAGE(OFF(68)); break;    STORAGE(OFF(69)); break;
    STORAGE(OFF(70)); break;    STORAGE(OFF(71)); break;
    STORAGE(OFF(72)); break;    STORAGE(OFF(73)); break;
    STORAGE(OFF(74)); break;    STORAGE(OFF(75)); break;
    STORAGE(OFF(76)); break;    STORAGE(OFF(77)); break;
    STORAGE(OFF(78)); break;    STORAGE(OFF(79)); break;
    STORAGE(OFF(80)); break;    STORAGE(OFF(81)); break;
    STORAGE(OFF(82)); break;    STORAGE(OFF(83)); break;
    STORAGE(OFF(84)); break;    STORAGE(OFF(85)); break;
    STORAGE(OFF(86)); break;    STORAGE(OFF(87)); break;
    STORAGE(OFF(88)); break;    STORAGE(OFF(89)); break;
    STORAGE(OFF(90)); break;    STORAGE(OFF(91)); break;
    STORAGE(OFF(92)); break;    STORAGE(OFF(93)); break;
    STORAGE(OFF(94)); break;    STORAGE(OFF(95)); break;
    STORAGE(OFF(96)); break;    STORAGE(OFF(97)); break;
    STORAGE(OFF(98)); break;    STORAGE(OFF(99)); break;
    STORAGE(OFF(100)); break;   STORAGE(OFF(101)); break;
    STORAGE(OFF(102)); break;   STORAGE(OFF(103)); break;
    STORAGE(OFF(104)); break;   STORAGE(OFF(105)); break;
    STORAGE(OFF(106)); break;   STORAGE(OFF(107)); break;
    STORAGE(OFF(108)); break;   STORAGE(OFF(109)); break;
    STORAGE(OFF(110)); break;   STORAGE(OFF(111)); break;
    STORAGE(OFF(112)); break;   STORAGE(OFF(113)); break;
    STORAGE(OFF(114)); break;   STORAGE(OFF(115)); break;
    STORAGE(OFF(116)); break;   STORAGE(OFF(117)); break;
    STORAGE(OFF(118)); break;   STORAGE(OFF(119)); break;
    STORAGE(OFF(120)); break;   STORAGE(OFF(121)); break;
    STORAGE(OFF(122)); break;   STORAGE(OFF(123)); break;
    STORAGE(OFF(124)); break;   STORAGE(OFF(125)); break;
    STORAGE(OFF(126)); break;   STORAGE(OFF(127)); break;
    STORAGE(OFF(128)); break;   STORAGE(OFF(129)); break;
    STORAGE(OFF(130)); break;   STORAGE(OFF(131)); break;
    STORAGE(OFF(132)); break;   STORAGE(OFF(133)); break;
    STORAGE(OFF(134)); break;   STORAGE(OFF(135)); break;
    STORAGE(OFF(136)); break;   STORAGE(OFF(137)); break;
    STORAGE(OFF(138)); break;   STORAGE(OFF(139)); break;
    STORAGE(OFF(140)); break;   STORAGE(OFF(141)); break;
    STORAGE(OFF(142)); break;   STORAGE(OFF(143)); break;
    STORAGE(OFF(144)); break;   STORAGE(OFF(145)); break;
    STORAGE(OFF(146)); break;   STORAGE(OFF(147)); break;
    STORAGE(OFF(148)); break;   STORAGE(OFF(149)); break;
    STORAGE(OFF(150)); break;   STORAGE(OFF(151)); break;
    STORAGE(OFF(152)); break;   STORAGE(OFF(153)); break;
    STORAGE(OFF(154)); break;   STORAGE(OFF(155)); break;
    STORAGE(OFF(156)); break;   STORAGE(OFF(157)); break;
    STORAGE(OFF(158)); break;   STORAGE(OFF(159)); break;
    STORAGE(OFF(160)); break;   STORAGE(OFF(161)); break;
    STORAGE(OFF(162)); break;   STORAGE(OFF(163)); break;
    STORAGE(OFF(164)); break;   STORAGE(OFF(165)); break;
    STORAGE(OFF(166)); break;   STORAGE(OFF(167)); break;
    STORAGE(OFF(168)); break;   STORAGE(OFF(169)); break;
    STORAGE(OFF(170)); break;   STORAGE(OFF(171)); break;
    STORAGE(OFF(172)); break;   STORAGE(OFF(173)); break;
    STORAGE(OFF(174)); break;   STORAGE(OFF(175)); break;
    STORAGE(OFF(176)); break;   STORAGE(OFF(177)); break;
    STORAGE(OFF(178)); break;   STORAGE(OFF(179)); break;
    STORAGE(OFF(180)); break;   STORAGE(OFF(181)); break;
    STORAGE(OFF(182)); break;   STORAGE(OFF(183)); break;
    STORAGE(OFF(184)); break;   STORAGE(OFF(185)); break;
    STORAGE(OFF(186)); break;   STORAGE(OFF(187)); break;
    STORAGE(OFF(188)); break;   STORAGE(OFF(189)); break;
    STORAGE(OFF(190)); break;

    /*-------------------------------------------------------------------------
     * Prefetch controller.
     */
    STORAGE(PRECON); break;     // Prefetch Control
    STORAGE(PRESTAT); break;    // Prefetch Status

    /*-------------------------------------------------------------------------
     * System controller.
     */
    STORAGE(CFGCON); break;     // Configuration Control
    STORAGE(DEVID); break;      // Device Identifier
    STORAGE(SYSKEY); break;     // System Key
    STORAGE(RCON); break;       // Reset Control
    STORAGE(RSWRST);            // Software Reset
        if ((VALUE(RSWRST) & 1) && s->stop_on_reset) {
            exit(0);
        }
        break;
    STORAGE(OSCCON); break;     // Oscillator Control
    STORAGE(OSCTUN); break;     // Oscillator Tuning
    STORAGE(SPLLCON); break;    // System PLL Control
    STORAGE(REFO1CON); break;
    STORAGE(REFO1CONCLR); *bufp = 0; break;
    STORAGE(REFO1CONSET); *bufp = 0; break;
    STORAGE(REFO1CONINV); *bufp = 0; break;
    STORAGE(REFO2CON); break;
    STORAGE(REFO2CONCLR); *bufp = 0; break;
    STORAGE(REFO2CONSET); *bufp = 0; break;
    STORAGE(REFO2CONINV); *bufp = 0; break;
    STORAGE(REFO3CON); break;
    STORAGE(REFO3CONCLR); *bufp = 0; break;
    STORAGE(REFO3CONSET); *bufp = 0; break;
    STORAGE(REFO3CONINV); *bufp = 0; break;
    STORAGE(REFO4CON); break;
    STORAGE(REFO4CONCLR); *bufp = 0; break;
    STORAGE(REFO4CONSET); *bufp = 0; break;
    STORAGE(REFO4CONINV); *bufp = 0; break;
    STORAGE(PB1DIV); break;     // Peripheral bus 1 divisor
    STORAGE(PB1DIVCLR); *bufp = 0; break;
    STORAGE(PB1DIVSET); *bufp = 0; break;
    STORAGE(PB1DIVINV); *bufp = 0; break;
    STORAGE(PB2DIV); break;     // Peripheral bus 2 divisor
    STORAGE(PB2DIVCLR); *bufp = 0; break;
    STORAGE(PB2DIVSET); *bufp = 0; break;
    STORAGE(PB2DIVINV); *bufp = 0; break;
    STORAGE(PB3DIV); break;     // Peripheral bus 3 divisor
    STORAGE(PB3DIVCLR); *bufp = 0; break;
    STORAGE(PB3DIVSET); *bufp = 0; break;
    STORAGE(PB3DIVINV); *bufp = 0; break;
    STORAGE(PB4DIV); break;     // Peripheral bus 4 divisor
    STORAGE(PB4DIVCLR); *bufp = 0; break;
    STORAGE(PB4DIVSET); *bufp = 0; break;
    STORAGE(PB4DIVINV); *bufp = 0; break;
    STORAGE(PB5DIV); break;     // Peripheral bus 5 divisor
    STORAGE(PB5DIVCLR); *bufp = 0; break;
    STORAGE(PB5DIVSET); *bufp = 0; break;
    STORAGE(PB5DIVINV); *bufp = 0; break;
    STORAGE(PB7DIV); break;     // Peripheral bus 7 divisor
    STORAGE(PB7DIVCLR); *bufp = 0; break;
    STORAGE(PB7DIVSET); *bufp = 0; break;
    STORAGE(PB7DIVINV); *bufp = 0; break;
    STORAGE(PB8DIV); break;     // Peripheral bus 8 divisor
    STORAGE(PB8DIVCLR); *bufp = 0; break;
    STORAGE(PB8DIVSET); *bufp = 0; break;
    STORAGE(PB8DIVINV); *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * Peripheral port select registers: input.
     */
    STORAGE(INT1R); break;
    STORAGE(INT2R); break;
    STORAGE(INT3R); break;
    STORAGE(INT4R); break;
    STORAGE(T2CKR); break;
    STORAGE(T3CKR); break;
    STORAGE(T4CKR); break;
    STORAGE(T5CKR); break;
    STORAGE(T6CKR); break;
    STORAGE(T7CKR); break;
    STORAGE(T8CKR); break;
    STORAGE(T9CKR); break;
    STORAGE(IC1R); break;
    STORAGE(IC2R); break;
    STORAGE(IC3R); break;
    STORAGE(IC4R); break;
    STORAGE(IC5R); break;
    STORAGE(IC6R); break;
    STORAGE(IC7R); break;
    STORAGE(IC8R); break;
    STORAGE(IC9R); break;
    STORAGE(OCFAR); break;
    STORAGE(U1RXR); break;
    STORAGE(U1CTSR); break;
    STORAGE(U2RXR); break;
    STORAGE(U2CTSR); break;
    STORAGE(U3RXR); break;
    STORAGE(U3CTSR); break;
    STORAGE(U4RXR); break;
    STORAGE(U4CTSR); break;
    STORAGE(U5RXR); break;
    STORAGE(U5CTSR); break;
    STORAGE(U6RXR); break;
    STORAGE(U6CTSR); break;
    STORAGE(SDI1R); break;
    STORAGE(SS1R); break;
    STORAGE(SDI2R); break;
    STORAGE(SS2R); break;
    STORAGE(SDI3R); break;
    STORAGE(SS3R); break;
    STORAGE(SDI4R); break;
    STORAGE(SS4R); break;
    STORAGE(SDI5R); break;
    STORAGE(SS5R); break;
    STORAGE(SDI6R); break;
    STORAGE(SS6R); break;
    STORAGE(C1RXR); break;
    STORAGE(C2RXR); break;
    STORAGE(REFCLKI1R); break;
    STORAGE(REFCLKI3R); break;
    STORAGE(REFCLKI4R); break;

    /*-------------------------------------------------------------------------
     * Peripheral port select registers: output.
     */
    STORAGE(RPA14R); break;
    STORAGE(RPA15R); break;
    STORAGE(RPB0R); break;
    STORAGE(RPB1R); break;
    STORAGE(RPB2R); break;
    STORAGE(RPB3R); break;
    STORAGE(RPB5R); break;
    STORAGE(RPB6R); break;
    STORAGE(RPB7R); break;
    STORAGE(RPB8R); break;
    STORAGE(RPB9R); break;
    STORAGE(RPB10R); break;
    STORAGE(RPB14R); break;
    STORAGE(RPB15R); break;
    STORAGE(RPC1R); break;
    STORAGE(RPC2R); break;
    STORAGE(RPC3R); break;
    STORAGE(RPC4R); break;
    STORAGE(RPC13R); break;
    STORAGE(RPC14R); break;
    STORAGE(RPD0R); break;
    STORAGE(RPD1R); break;
    STORAGE(RPD2R); break;
    STORAGE(RPD3R); break;
    STORAGE(RPD4R); break;
    STORAGE(RPD5R); break;
    STORAGE(RPD6R); break;
    STORAGE(RPD7R); break;
    STORAGE(RPD9R); break;
    STORAGE(RPD10R); break;
    STORAGE(RPD11R); break;
    STORAGE(RPD12R); break;
    STORAGE(RPD14R); break;
    STORAGE(RPD15R); break;
    STORAGE(RPE3R); break;
    STORAGE(RPE5R); break;
    STORAGE(RPE8R); break;
    STORAGE(RPE9R); break;
    STORAGE(RPF0R); break;
    STORAGE(RPF1R); break;
    STORAGE(RPF2R); break;
    STORAGE(RPF3R); break;
    STORAGE(RPF4R); break;
    STORAGE(RPF5R); break;
    STORAGE(RPF8R); break;
    STORAGE(RPF12R); break;
    STORAGE(RPF13R); break;
    STORAGE(RPG0R); break;
    STORAGE(RPG1R); break;
    STORAGE(RPG6R); break;
    STORAGE(RPG7R); break;
    STORAGE(RPG8R); break;
    STORAGE(RPG9R); break;

    /*-------------------------------------------------------------------------
     * General purpose IO signals.
     */
    STORAGE(ANSELA); break;     // Port A: analog select
    STORAGE(TRISA); break;      // Port A: mask of inputs
    STORAGE(PORTA); break;      // Port A: read inputs
    STORAGE(LATA); break;       // Port A: read outputs
    STORAGE(ODCA); break;       // Port A: open drain configuration
    STORAGE(CNPUA); break;      // Input pin pull-up
    STORAGE(CNPDA); break;      // Input pin pull-down
    STORAGE(CNCONA); break;     // Interrupt-on-change control
    STORAGE(CNENA); break;      // Input change interrupt enable
    STORAGE(CNSTATA); break;    // Input change status

