sergev/qemu/hw/mips/mips_pic32mz.c
    STORAGE(ANSELB); break;     // Port B: analog select
    STORAGE(TRISB); break;      // Port B: mask of inputs
    STORAGE(PORTB); break;      // Port B: read inputs
    STORAGE(LATB); break;       // Port B: read outputs
    STORAGE(ODCB); break;       // Port B: open drain configuration
    STORAGE(CNPUB); break;      // Input pin pull-up
    STORAGE(CNPDB); break;      // Input pin pull-down
    STORAGE(CNCONB); break;     // Interrupt-on-change control
    STORAGE(CNENB); break;      // Input change interrupt enable
    STORAGE(CNSTATB); break;    // Input change status

    STORAGE(ANSELC); break;     // Port C: analog select
    STORAGE(TRISC); break;      // Port C: mask of inputs
    STORAGE(PORTC); break;      // Port C: read inputs
    STORAGE(LATC); break;       // Port C: read outputs
    STORAGE(ODCC); break;       // Port C: open drain configuration
    STORAGE(CNPUC); break;      // Input pin pull-up
    STORAGE(CNPDC); break;      // Input pin pull-down
    STORAGE(CNCONC); break;     // Interrupt-on-change control
    STORAGE(CNENC); break;      // Input change interrupt enable
    STORAGE(CNSTATC); break;    // Input change status

    STORAGE(ANSELD); break;     // Port D: analog select
    STORAGE(TRISD); break;      // Port D: mask of inputs
    STORAGE(PORTD); break;      // Port D: read inputs
    STORAGE(LATD); break;       // Port D: read outputs
    STORAGE(ODCD); break;       // Port D: open drain configuration
    STORAGE(CNPUD); break;      // Input pin pull-up
    STORAGE(CNPDD); break;      // Input pin pull-down
    STORAGE(CNCOND); break;     // Interrupt-on-change control
    STORAGE(CNEND); break;      // Input change interrupt enable
    STORAGE(CNSTATD); break;    // Input change status

    STORAGE(ANSELE); break;     // Port E: analog select
    STORAGE(TRISE); break;      // Port E: mask of inputs
    STORAGE(PORTE); break;      // Port E: read inputs
    STORAGE(LATE); break;       // Port E: read outputs
    STORAGE(ODCE); break;       // Port E: open drain configuration
    STORAGE(CNPUE); break;      // Input pin pull-up
    STORAGE(CNPDE); break;      // Input pin pull-down
    STORAGE(CNCONE); break;     // Interrupt-on-change control
    STORAGE(CNENE); break;      // Input change interrupt enable
    STORAGE(CNSTATE); break;    // Input change status

    STORAGE(ANSELF); break;     // Port F: analog select
    STORAGE(TRISF); break;      // Port F: mask of inputs
    STORAGE(PORTF); break;      // Port F: read inputs
    STORAGE(LATF); break;       // Port F: read outputs
    STORAGE(ODCF); break;       // Port F: open drain configuration
    STORAGE(CNPUF); break;      // Input pin pull-up
    STORAGE(CNPDF); break;      // Input pin pull-down
    STORAGE(CNCONF); break;     // Interrupt-on-change control
    STORAGE(CNENF); break;      // Input change interrupt enable
    STORAGE(CNSTATF); break;    // Input change status

    STORAGE(ANSELG); break;     // Port G: analog select
    STORAGE(TRISG); break;      // Port G: mask of inputs
    STORAGE(PORTG); break;      // Port G: read inputs
    STORAGE(LATG); break;       // Port G: read outputs
    STORAGE(ODCG); break;       // Port G: open drain configuration
    STORAGE(CNPUG); break;      // Input pin pull-up
    STORAGE(CNPDG); break;      // Input pin pull-down
    STORAGE(CNCONG); break;     // Interrupt-on-change control
    STORAGE(CNENG); break;      // Input change interrupt enable
    STORAGE(CNSTATG); break;    // Input change status

    STORAGE(ANSELH); break;     // Port H: analog select
    STORAGE(TRISH); break;      // Port H: mask of inputs
    STORAGE(PORTH); break;      // Port H: read inputs
    STORAGE(LATH); break;       // Port H: read outputs
    STORAGE(ODCH); break;       // Port H: open drain configuration
    STORAGE(CNPUH); break;      // Input pin pull-up
    STORAGE(CNPDH); break;      // Input pin pull-down
    STORAGE(CNCONH); break;     // Interrupt-on-change control
    STORAGE(CNENH); break;      // Input change interrupt enable
    STORAGE(CNSTATH); break;    // Input change status

    STORAGE(ANSELJ); break;     // Port J: analog select
    STORAGE(TRISJ); break;      // Port J: mask of inputs
    STORAGE(PORTJ); break;      // Port J: read inputs
    STORAGE(LATJ); break;       // Port J: read outputs
    STORAGE(ODCJ); break;       // Port J: open drain configuration
    STORAGE(CNPUJ); break;      // Input pin pull-up
    STORAGE(CNPDJ); break;      // Input pin pull-down
    STORAGE(CNCONJ); break;     // Interrupt-on-change control
    STORAGE(CNENJ); break;      // Input change interrupt enable
    STORAGE(CNSTATJ); break;    // Input change status

    STORAGE(TRISK); break;      // Port K: mask of inputs
    STORAGE(PORTK); break;      // Port K: read inputs
    STORAGE(LATK); break;       // Port K: read outputs
    STORAGE(ODCK); break;       // Port K: open drain configuration
    STORAGE(CNPUK); break;      // Input pin pull-up
    STORAGE(CNPDK); break;      // Input pin pull-down
    STORAGE(CNCONK); break;     // Interrupt-on-change control
    STORAGE(CNENK); break;      // Input change interrupt enable
    STORAGE(CNSTATK); break;    // Input change status

    /*-------------------------------------------------------------------------
     * UART 1.
     */
    STORAGE(U1RXREG);                           // Receive data
        *bufp = pic32_uart_get_char(s, 0);
        break;
    STORAGE(U1BRG); break;                      // Baud rate
    STORAGE(U1MODE); break;                     // Mode
    STORAGE(U1STA);                             // Status and control
        pic32_uart_poll_status(s, 0);
        break;
    STORAGE(U1TXREG);   *bufp = 0; break;       // Transmit
    STORAGE(U1MODECLR); *bufp = 0; break;
    STORAGE(U1MODESET); *bufp = 0; break;
    STORAGE(U1MODEINV); *bufp = 0; break;
    STORAGE(U1STACLR);  *bufp = 0; break;
    STORAGE(U1STASET);  *bufp = 0; break;
    STORAGE(U1STAINV);  *bufp = 0; break;
    STORAGE(U1BRGCLR);  *bufp = 0; break;
    STORAGE(U1BRGSET);  *bufp = 0; break;
    STORAGE(U1BRGINV);  *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * UART 2.
     */
    STORAGE(U2RXREG);                           // Receive data
        *bufp = pic32_uart_get_char(s, 1);
        break;
    STORAGE(U2BRG); break;                      // Baud rate
    STORAGE(U2MODE); break;                     // Mode
    STORAGE(U2STA);                             // Status and control
        pic32_uart_poll_status(s, 1);
        break;
    STORAGE(U2TXREG);   *bufp = 0; break;       // Transmit
    STORAGE(U2MODECLR); *bufp = 0; break;
    STORAGE(U2MODESET); *bufp = 0; break;
    STORAGE(U2MODEINV); *bufp = 0; break;
    STORAGE(U2STACLR);  *bufp = 0; break;
    STORAGE(U2STASET);  *bufp = 0; break;
    STORAGE(U2STAINV);  *bufp = 0; break;
    STORAGE(U2BRGCLR);  *bufp = 0; break;
    STORAGE(U2BRGSET);  *bufp = 0; break;
    STORAGE(U2BRGINV);  *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * UART 3.
     */
    STORAGE(U3RXREG);                           // Receive data
        *bufp = pic32_uart_get_char(s, 2);
        break;
    STORAGE(U3BRG); break;                      // Baud rate
    STORAGE(U3MODE); break;                     // Mode
    STORAGE(U3STA);                             // Status and control
        pic32_uart_poll_status(s, 2);
        break;
    STORAGE(U3TXREG);   *bufp = 0; break;       // Transmit
    STORAGE(U3MODECLR); *bufp = 0; break;
    STORAGE(U3MODESET); *bufp = 0; break;
    STORAGE(U3MODEINV); *bufp = 0; break;
    STORAGE(U3STACLR);  *bufp = 0; break;
    STORAGE(U3STASET);  *bufp = 0; break;
    STORAGE(U3STAINV);  *bufp = 0; break;
    STORAGE(U3BRGCLR);  *bufp = 0; break;
    STORAGE(U3BRGSET);  *bufp = 0; break;
    STORAGE(U3BRGINV);  *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * UART 4.
     */
    STORAGE(U4RXREG);                           // Receive data
        *bufp = pic32_uart_get_char(s, 3);
        break;
    STORAGE(U4BRG); break;                      // Baud rate
    STORAGE(U4MODE); break;                     // Mode
    STORAGE(U4STA);                             // Status and control
        pic32_uart_poll_status(s, 3);
        break;
    STORAGE(U4TXREG);   *bufp = 0; break;       // Transmit
    STORAGE(U4MODECLR); *bufp = 0; break;
    STORAGE(U4MODESET); *bufp = 0; break;
    STORAGE(U4MODEINV); *bufp = 0; break;
    STORAGE(U4STACLR);  *bufp = 0; break;
    STORAGE(U4STASET);  *bufp = 0; break;
    STORAGE(U4STAINV);  *bufp = 0; break;
    STORAGE(U4BRGCLR);  *bufp = 0; break;
    STORAGE(U4BRGSET);  *bufp = 0; break;
    STORAGE(U4BRGINV);  *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * UART 5.
     */
    STORAGE(U5RXREG);                           // Receive data
        *bufp = pic32_uart_get_char(s, 4);
        break;
    STORAGE(U5BRG); break;                      // Baud rate
    STORAGE(U5MODE); break;                     // Mode
    STORAGE(U5STA);                             // Status and control
        pic32_uart_poll_status(s, 4);
        break;
    STORAGE(U5TXREG);   *bufp = 0; break;       // Transmit
    STORAGE(U5MODECLR); *bufp = 0; break;
    STORAGE(U5MODESET); *bufp = 0; break;
    STORAGE(U5MODEINV); *bufp = 0; break;
    STORAGE(U5STACLR);  *bufp = 0; break;
    STORAGE(U5STASET);  *bufp = 0; break;
    STORAGE(U5STAINV);  *bufp = 0; break;
    STORAGE(U5BRGCLR);  *bufp = 0; break;
    STORAGE(U5BRGSET);  *bufp = 0; break;
    STORAGE(U5BRGINV);  *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * UART 6.
     */
    STORAGE(U6RXREG);                           // Receive data
        *bufp = pic32_uart_get_char(s, 5);
        break;
    STORAGE(U6BRG); break;                      // Baud rate
    STORAGE(U6MODE); break;                     // Mode
    STORAGE(U6STA);                             // Status and control
        pic32_uart_poll_status(s, 5);
        break;
    STORAGE(U6TXREG);   *bufp = 0; break;       // Transmit
    STORAGE(U6MODECLR); *bufp = 0; break;
    STORAGE(U6MODESET); *bufp = 0; break;
    STORAGE(U6MODEINV); *bufp = 0; break;
    STORAGE(U6STACLR);  *bufp = 0; break;
    STORAGE(U6STASET);  *bufp = 0; break;
    STORAGE(U6STAINV);  *bufp = 0; break;
    STORAGE(U6BRGCLR);  *bufp = 0; break;
    STORAGE(U6BRGSET);  *bufp = 0; break;
    STORAGE(U6BRGINV);  *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * SPI 1.
     */
    STORAGE(SPI1CON); break;                    // Control
    STORAGE(SPI1CONCLR); *bufp = 0; break;
    STORAGE(SPI1CONSET); *bufp = 0; break;
    STORAGE(SPI1CONINV); *bufp = 0; break;
    STORAGE(SPI1STAT); break;                   // Status
    STORAGE(SPI1STATCLR); *bufp = 0; break;
    STORAGE(SPI1STATSET); *bufp = 0; break;
    STORAGE(SPI1STATINV); *bufp = 0; break;
    STORAGE(SPI1BUF);                           // Buffer
        *bufp = pic32_spi_readbuf(s, 0);
        break;
    STORAGE(SPI1BRG); break;                    // Baud rate
    STORAGE(SPI1BRGCLR); *bufp = 0; break;
    STORAGE(SPI1BRGSET); *bufp = 0; break;
    STORAGE(SPI1BRGINV); *bufp = 0; break;
    STORAGE(SPI1CON2); break;                   // Control 2
    STORAGE(SPI1CON2CLR); *bufp = 0; break;
    STORAGE(SPI1CON2SET); *bufp = 0; break;
    STORAGE(SPI1CON2INV); *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * SPI 2.
     */
    STORAGE(SPI2CON); break;                    // Control
    STORAGE(SPI2CONCLR); *bufp = 0; break;
    STORAGE(SPI2CONSET); *bufp = 0; break;
    STORAGE(SPI2CONINV); *bufp = 0; break;
    STORAGE(SPI2STAT); break;                   // Status
    STORAGE(SPI2STATCLR); *bufp = 0; break;
    STORAGE(SPI2STATSET); *bufp = 0; break;
    STORAGE(SPI2STATINV); *bufp = 0; break;
    STORAGE(SPI2BUF);                           // Buffer
        *bufp = pic32_spi_readbuf(s, 1);
        break;
    STORAGE(SPI2BRG); break;                    // Baud rate
    STORAGE(SPI2BRGCLR); *bufp = 0; break;
    STORAGE(SPI2BRGSET); *bufp = 0; break;
    STORAGE(SPI2BRGINV); *bufp = 0; break;
    STORAGE(SPI2CON2); break;                   // Control 2
    STORAGE(SPI2CON2CLR); *bufp = 0; break;
    STORAGE(SPI2CON2SET); *bufp = 0; break;
    STORAGE(SPI2CON2INV); *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * SPI 3.
     */
    STORAGE(SPI3CON); break;                    // Control
    STORAGE(SPI3CONCLR); *bufp = 0; break;
    STORAGE(SPI3CONSET); *bufp = 0; break;
    STORAGE(SPI3CONINV); *bufp = 0; break;
    STORAGE(SPI3STAT); break;                   // Status
    STORAGE(SPI3STATCLR); *bufp = 0; break;
    STORAGE(SPI3STATSET); *bufp = 0; break;
    STORAGE(SPI3STATINV); *bufp = 0; break;
    STORAGE(SPI3BUF);                           // SPIx Buffer
        *bufp = pic32_spi_readbuf(s, 2);
        break;
    STORAGE(SPI3BRG); break;                    // Baud rate
    STORAGE(SPI3BRGCLR); *bufp = 0; break;
    STORAGE(SPI3BRGSET); *bufp = 0; break;
    STORAGE(SPI3BRGINV); *bufp = 0; break;
    STORAGE(SPI3CON2); break;                   // Control 2
    STORAGE(SPI3CON2CLR); *bufp = 0; break;
    STORAGE(SPI3CON2SET); *bufp = 0; break;
    STORAGE(SPI3CON2INV); *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * SPI 4.
     */
    STORAGE(SPI4CON); break;                    // Control
    STORAGE(SPI4CONCLR); *bufp = 0; break;
    STORAGE(SPI4CONSET); *bufp = 0; break;
    STORAGE(SPI4CONINV); *bufp = 0; break;
    STORAGE(SPI4STAT); break;                   // Status
    STORAGE(SPI4STATCLR); *bufp = 0; break;
    STORAGE(SPI4STATSET); *bufp = 0; break;
    STORAGE(SPI4STATINV); *bufp = 0; break;
    STORAGE(SPI4BUF);                           // Buffer
        *bufp = pic32_spi_readbuf(s, 3);
        break;
    STORAGE(SPI4BRG); break;                    // Baud rate
    STORAGE(SPI4BRGCLR); *bufp = 0; break;
    STORAGE(SPI4BRGSET); *bufp = 0; break;
    STORAGE(SPI4BRGINV); *bufp = 0; break;
    STORAGE(SPI4CON2); break;                   // Control 2
    STORAGE(SPI4CON2CLR); *bufp = 0; break;
    STORAGE(SPI4CON2SET); *bufp = 0; break;
    STORAGE(SPI4CON2INV); *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * Timers.
     */
    STORAGE(T1CON); break;
    STORAGE(TMR1); break;
    STORAGE(PR1); break;
    STORAGE(T2CON); break;
    STORAGE(TMR2); break;
    STORAGE(PR2); break;
    STORAGE(T3CON); break;
    STORAGE(TMR3); break;
    STORAGE(PR3); break;
    STORAGE(T4CON); break;
    STORAGE(TMR4); break;
    STORAGE(PR4); break;
    STORAGE(T5CON); break;
    STORAGE(TMR5); break;
    STORAGE(PR5); break;
    STORAGE(T6CON); break;
    STORAGE(TMR6); break;
    STORAGE(PR6); break;
    STORAGE(T7CON); break;
    STORAGE(TMR7); break;
    STORAGE(PR7); break;
    STORAGE(T8CON); break;
    STORAGE(TMR8); break;
    STORAGE(PR8); break;
    STORAGE(T9CON); break;
    STORAGE(TMR9); break;
    STORAGE(PR9); break;

    /*-------------------------------------------------------------------------
     * Ethernet.
     */
    STORAGE(ETHCON1); break;            // Control 1
    STORAGE(ETHCON2); break;            // Control 2: RX data buffer size
    STORAGE(ETHTXST); break;            // Tx descriptor start address
    STORAGE(ETHRXST); break;            // Rx descriptor start address
    STORAGE(ETHHT0); break;             // Hash tasble 0
    STORAGE(ETHHT1); break;             // Hash tasble 1
    STORAGE(ETHPMM0); break;            // Pattern match mask 0
    STORAGE(ETHPMM1); break;            // Pattern match mask 1
    STORAGE(ETHPMCS); break;            // Pattern match checksum
    STORAGE(ETHPMO); break;             // Pattern match offset
    STORAGE(ETHRXFC); break;            // Receive filter configuration
    STORAGE(ETHRXWM); break;            // Receive watermarks
    STORAGE(ETHIEN); break;             // Interrupt enable
    STORAGE(ETHIRQ); break;             // Interrupt request
    STORAGE(ETHSTAT); break;            // Status
    STORAGE(ETHRXOVFLOW); break;        // Receive overflow statistics
    STORAGE(ETHFRMTXOK); break;         // Frames transmitted OK statistics
    STORAGE(ETHSCOLFRM); break;         // Single collision frames statistics
    STORAGE(ETHMCOLFRM); break;         // Multiple collision frames statistics
    STORAGE(ETHFRMRXOK); break;         // Frames received OK statistics
    STORAGE(ETHFCSERR); break;          // Frame check sequence error statistics
    STORAGE(ETHALGNERR); break;         // Alignment errors statistics
    STORAGE(EMAC1CFG1); break;          // MAC configuration 1
    STORAGE(EMAC1CFG2); break;          // MAC configuration 2
    STORAGE(EMAC1IPGT); break;          // MAC back-to-back interpacket gap
    STORAGE(EMAC1IPGR); break;          // MAC non-back-to-back interpacket gap
    STORAGE(EMAC1CLRT); break;          // MAC collision window/retry limit
    STORAGE(EMAC1MAXF); break;          // MAC maximum frame length
    STORAGE(EMAC1SUPP); break;          // MAC PHY support
    STORAGE(EMAC1TEST); break;          // MAC test
    STORAGE(EMAC1MCFG); break;          // MII configuration
    STORAGE(EMAC1MCMD); break;          // MII command
    STORAGE(EMAC1MADR); break;          // MII address
    STORAGE(EMAC1MWTD); break;          // MII write data
    STORAGE(EMAC1MRDD); break;          // MII read data
    STORAGE(EMAC1MIND); break;          // MII indicators
    STORAGE(EMAC1SA0); break;           // MAC station address 0
    STORAGE(EMAC1SA1); break;           // MAC station address 1
    STORAGE(EMAC1SA2); break;           // MAC station address 2

    /*-------------------------------------------------------------------------
     * USB.
     */
    STORAGE(USBCSR0); break;
    STORAGE(USBCSR1); break;
    STORAGE(USBCSR2); break;
    STORAGE(USBCSR3); break;
    STORAGE(USBIENCSR0); break;
    STORAGE(USBIENCSR1); break;
    STORAGE(USBIENCSR2); break;
    STORAGE(USBIENCSR3); break;
    STORAGE(USBFIFO0); break;
    STORAGE(USBFIFO1); break;
    STORAGE(USBFIFO2); break;
    STORAGE(USBFIFO3); break;
    STORAGE(USBFIFO4); break;
    STORAGE(USBFIFO5); break;
    STORAGE(USBFIFO6); break;
    STORAGE(USBFIFO7); break;
    STORAGE(USBOTG); break;
    STORAGE(USBFIFOA); break;
    STORAGE(USBHWVER); break;
    STORAGE(USBINFO); break;
    STORAGE(USBEOFRST); break;
    STORAGE(USBE0TXA); break;
    STORAGE(USBE0RXA); break;
    STORAGE(USBE1TXA); break;
    STORAGE(USBE1RXA); break;
    STORAGE(USBE2TXA); break;
    STORAGE(USBE2RXA); break;
    STORAGE(USBE3TXA); break;
    STORAGE(USBE3RXA); break;
    STORAGE(USBE4TXA); break;
    STORAGE(USBE4RXA); break;
    STORAGE(USBE5TXA); break;
    STORAGE(USBE5RXA); break;
    STORAGE(USBE6TXA); break;
    STORAGE(USBE6RXA); break;
    STORAGE(USBE7TXA); break;
    STORAGE(USBE7RXA); break;
    STORAGE(USBE0CSR0); break;
    STORAGE(USBE0CSR2); break;
    STORAGE(USBE0CSR3); break;
    STORAGE(USBE1CSR0); break;
    STORAGE(USBE1CSR1); break;
    STORAGE(USBE1CSR2); break;
    STORAGE(USBE1CSR3); break;
    STORAGE(USBE2CSR0); break;
    STORAGE(USBE2CSR1); break;
    STORAGE(USBE2CSR2); break;
    STORAGE(USBE2CSR3); break;
    STORAGE(USBE3CSR0); break;
    STORAGE(USBE3CSR1); break;
    STORAGE(USBE3CSR2); break;
    STORAGE(USBE3CSR3); break;
    STORAGE(USBE4CSR0); break;
    STORAGE(USBE4CSR1); break;
    STORAGE(USBE4CSR2); break;
    STORAGE(USBE4CSR3); break;
    STORAGE(USBE5CSR0); break;
    STORAGE(USBE5CSR1); break;
    STORAGE(USBE5CSR2); break;
    STORAGE(USBE5CSR3); break;
    STORAGE(USBE6CSR0); break;
    STORAGE(USBE6CSR1); break;
    STORAGE(USBE6CSR2); break;
    STORAGE(USBE6CSR3); break;
    STORAGE(USBE7CSR0); break;
    STORAGE(USBE7CSR1); break;
    STORAGE(USBE7CSR2); break;
    STORAGE(USBE7CSR3); break;
    STORAGE(USBDMAINT); break;
    STORAGE(USBDMA1C); break;
    STORAGE(USBDMA1A); break;
    STORAGE(USBDMA1N); break;
    STORAGE(USBDMA2C); break;
    STORAGE(USBDMA2A); break;
    STORAGE(USBDMA2N); break;
    STORAGE(USBDMA3C); break;
    STORAGE(USBDMA3A); break;
    STORAGE(USBDMA3N); break;
    STORAGE(USBDMA4C); break;
    STORAGE(USBDMA4A); break;
    STORAGE(USBDMA4N); break;
    STORAGE(USBDMA5C); break;
    STORAGE(USBDMA5A); break;
    STORAGE(USBDMA5N); break;
    STORAGE(USBDMA6C); break;
    STORAGE(USBDMA6A); break;
    STORAGE(USBDMA6N); break;
    STORAGE(USBDMA7C); break;
    STORAGE(USBDMA7A); break;
    STORAGE(USBDMA7N); break;
    STORAGE(USBDMA8C); break;
    STORAGE(USBDMA8A); break;
    STORAGE(USBDMA8N); break;
    STORAGE(USBE1RPC); break;
    STORAGE(USBE2RPC); break;
    STORAGE(USBE3RPC); break;
    STORAGE(USBE4RPC); break;
    STORAGE(USBE5RPC); break;
    STORAGE(USBE6RPC); break;
    STORAGE(USBE7RPC); break;
    STORAGE(USBDPBFD); break;
    STORAGE(USBTMCON1); break;
    STORAGE(USBTMCON2); break;
    STORAGE(USBLPMR1); break;
    STORAGE(USBLMPR2); break;

    default:
        printf("--- Read 1f8%05x: peripheral register not supported\n",
            offset);
        if (TRACE)
            fprintf(qemu_logfile, "--- Read 1f8%05x: peripheral register not supported\n",
                offset);
        exit(1);
    }
    return *bufp;
}

static void pps_input_group1(unsigned address, unsigned data)
{
    // 0000 = RPD1
    // 0001 = RPG9
    // 0010 = RPB14
    // 0011 = RPD0
    // 0101 = RPB6
    // 0110 = RPD5
    // 0111 = RPB2
    // 1000 = RPF3
    // 1001 = RPF13
    // 1011 = RPF2
    // 1100 = RPC2
    // 1101 = RPE8
}

static void pps_input_group2(unsigned address, unsigned data)
{
    // 0000 = RPD9
    // 0001 = RPG6
    // 0010 = RPB8
    // 0011 = RPB15
    // 0100 = RPD4
    // 0101 = RPB0
    // 0110 = RPE3
    // 0111 = RPB7
    // 1001 = RPF12
    // 1010 = RPD12
    // 1011 = RPF8
    // 1100 = RPC3
    // 1101 = RPE9
}

static void pps_input_group3(unsigned address, unsigned data)
{
    // 0000 = RPD2
    // 0001 = RPG8
    // 0010 = RPF4
    // 0011 = RPD10
    // 0100 = RPF1
    // 0101 = RPB9
    // 0110 = RPB10
    // 0111 = RPC14
    // 1000 = RPB5
    // 1010 = RPC1
    // 1011 = RPD14
    // 1100 = RPG1
    // 1101 = RPA14
    // 1110 = RPD6
}

static void pps_input_group4(unsigned address, unsigned data)
{
    // 0000 = RPD3
    // 0001 = RPG7
    // 0010 = RPF5
    // 0011 = RPD11
    // 0100 = RPF0
    // 0101 = RPB1
    // 0110 = RPE5
    // 0111 = RPC13
    // 1000 = RPB3
    // 1010 = RPC4
    // 1011 = RPD15
    // 1100 = RPG0
    // 1101 = RPA15
    // 1110 = RPD7
}

static void pps_output_group1(unsigned address, unsigned data)
{
    // 0000 = No Connect
    // 0001 = U1TX
    // 0010 = U2RTS
    // 0011 = U5TX
    // 0100 = U6RTS
    // 0101 = SDO1
    // 0110 = SDO2
    // 0111 = SDO3
    // 1000 = SDO4
    // 1001 = SDO5
    // 1011 = OC4
    // 1100 = OC7
    // 1111 = REFCLKO1
}

static void pps_output_group2(unsigned address, unsigned data)
{
    // 0000 = No Connect
    // 0001 = U1RTS
    // 0010 = U2TX
    // 0011 = U5RTS
    // 0100 = U6TX
    // 0110 = SS2
    // 1000 = SDO4
    // 1010 = SDO6
    // 1011 = OC2
    // 1100 = OC1
    // 1101 = OC9
    // 1111 = C2TX
}

static void pps_output_group3(unsigned address, unsigned data)
{
    // 0000 = No Connect
    // 0001 = U3TX
    // 0010 = U4RTS
    // 0101 = SDO1
    // 0110 = SDO2
    // 0111 = SDO3
    // 1001 = SDO5
    // 1010 = SS6
    // 1011 = OC3
    // 1100 = OC6
    // 1101 = REFCLKO4
    // 1110 = C2OUT
    // 1111 = C1TX
}

