sergev/qemu/hw/mips/mips_pic32mz.c
static void pps_output_group4(unsigned address, unsigned data)
{
    // 0000 = No Connect
    // 0001 = U3RTS
    // 0010 = U4TX
    // 0100 = U6TX
    // 0101 = SS1
    // 0111 = SS3
    // 1000 = SS4
    // 1001 = SS5
    // 1010 = SDO6
    // 1011 = OC5
    // 1100 = OC8
    // 1110 = C1OUT
    // 1111 = REFCLKO3
}

static void io_write32(pic32_t *s, unsigned offset, unsigned data, const char **namep)
{
    unsigned *bufp = &VALUE(offset);
    unsigned mask;

    switch (offset) {
    /*-------------------------------------------------------------------------
     * Interrupt controller registers.
     */
    WRITEOP(INTCON); return;    // Interrupt Control
    READONLY(INTSTAT);          // Interrupt Status
    WRITEOP(IPTMR);  return;    // Temporal Proximity Timer
    WRITEOP(IFS0); goto irq;    // IFS(0..2) - Interrupt Flag Status
    WRITEOP(IFS1); goto irq;
    WRITEOP(IFS2); goto irq;
    WRITEOP(IFS3); goto irq;
    WRITEOP(IFS4); goto irq;
    WRITEOP(IFS5); goto irq;
    WRITEOP(IEC0); goto irq;    // IEC(0..2) - Interrupt Enable Control
    WRITEOP(IEC1); goto irq;
    WRITEOP(IEC2); goto irq;
    WRITEOP(IEC3); goto irq;
    WRITEOP(IEC4); goto irq;
    WRITEOP(IEC5); goto irq;

    // IPC(0..11) - Interrupt Priority Control
    WRITEOP(IPC0); goto irq;    WRITEOP(IPC1); goto irq;
    WRITEOP(IPC2); goto irq;    WRITEOP(IPC3); goto irq;
    WRITEOP(IPC4); goto irq;    WRITEOP(IPC5); goto irq;
    WRITEOP(IPC6); goto irq;    WRITEOP(IPC7); goto irq;
    WRITEOP(IPC8); goto irq;    WRITEOP(IPC9); goto irq;
    WRITEOP(IPC10); goto irq;   WRITEOP(IPC11); goto irq;
    WRITEOP(IPC12); goto irq;   WRITEOP(IPC13); goto irq;
    WRITEOP(IPC14); goto irq;   WRITEOP(IPC15); goto irq;
    WRITEOP(IPC16); goto irq;   WRITEOP(IPC17); goto irq;
    WRITEOP(IPC18); goto irq;   WRITEOP(IPC19); goto irq;
    WRITEOP(IPC20); goto irq;   WRITEOP(IPC21); goto irq;
    WRITEOP(IPC22); goto irq;   WRITEOP(IPC23); goto irq;
    WRITEOP(IPC24); goto irq;   WRITEOP(IPC25); goto irq;
    WRITEOP(IPC26); goto irq;   WRITEOP(IPC27); goto irq;
    WRITEOP(IPC28); goto irq;   WRITEOP(IPC29); goto irq;
    WRITEOP(IPC30); goto irq;   WRITEOP(IPC31); goto irq;
    WRITEOP(IPC32); goto irq;   WRITEOP(IPC33); goto irq;
    WRITEOP(IPC34); goto irq;   WRITEOP(IPC35); goto irq;
    WRITEOP(IPC36); goto irq;   WRITEOP(IPC37); goto irq;
    WRITEOP(IPC38); goto irq;   WRITEOP(IPC39); goto irq;
    WRITEOP(IPC40); goto irq;   WRITEOP(IPC41); goto irq;
    WRITEOP(IPC42); goto irq;   WRITEOP(IPC43); goto irq;
    WRITEOP(IPC44); goto irq;   WRITEOP(IPC45); goto irq;
    WRITEOP(IPC46); goto irq;   WRITEOP(IPC47);
irq:    update_irq_status(s);
        return;

    // OFF000..OFF190 - Interrupt Vector Address Offset
    STORAGE(OFF(0)); break;     STORAGE(OFF(1)); break;
    STORAGE(OFF(2)); break;     STORAGE(OFF(3)); break;
    STORAGE(OFF(4)); break;     STORAGE(OFF(5)); break;
    STORAGE(OFF(6)); break;     STORAGE(OFF(7)); break;
    STORAGE(OFF(8)); break;     STORAGE(OFF(9)); break;
    STORAGE(OFF(10)); break;    STORAGE(OFF(11)); break;
    STORAGE(OFF(12)); break;    STORAGE(OFF(13)); break;
    STORAGE(OFF(14)); break;    STORAGE(OFF(15)); break;
    STORAGE(OFF(16)); break;    STORAGE(OFF(17)); break;
    STORAGE(OFF(18)); break;    STORAGE(OFF(19)); break;
    STORAGE(OFF(20)); break;    STORAGE(OFF(21)); break;
    STORAGE(OFF(22)); break;    STORAGE(OFF(23)); break;
    STORAGE(OFF(24)); break;    STORAGE(OFF(25)); break;
    STORAGE(OFF(26)); break;    STORAGE(OFF(27)); break;
    STORAGE(OFF(28)); break;    STORAGE(OFF(29)); break;
    STORAGE(OFF(30)); break;    STORAGE(OFF(31)); break;
    STORAGE(OFF(32)); break;    STORAGE(OFF(33)); break;
    STORAGE(OFF(34)); break;    STORAGE(OFF(35)); break;
    STORAGE(OFF(36)); break;    STORAGE(OFF(37)); break;
    STORAGE(OFF(38)); break;    STORAGE(OFF(39)); break;
    STORAGE(OFF(40)); break;    STORAGE(OFF(41)); break;
    STORAGE(OFF(42)); break;    STORAGE(OFF(43)); break;
    STORAGE(OFF(44)); break;    STORAGE(OFF(45)); break;
    STORAGE(OFF(46)); break;    STORAGE(OFF(47)); break;
    STORAGE(OFF(48)); break;    STORAGE(OFF(49)); break;
    STORAGE(OFF(50)); break;    STORAGE(OFF(51)); break;
    STORAGE(OFF(52)); break;    STORAGE(OFF(53)); break;
    STORAGE(OFF(54)); break;    STORAGE(OFF(55)); break;
    STORAGE(OFF(56)); break;    STORAGE(OFF(57)); break;
    STORAGE(OFF(58)); break;    STORAGE(OFF(59)); break;
    STORAGE(OFF(60)); break;    STORAGE(OFF(61)); break;
    STORAGE(OFF(62)); break;    STORAGE(OFF(63)); break;
    STORAGE(OFF(64)); break;    STORAGE(OFF(65)); break;
    STORAGE(OFF(66)); break;    STORAGE(OFF(67)); break;
    STORAGE(OFF(68)); break;    STORAGE(OFF(69)); break;
    STORAGE(OFF(70)); break;    STORAGE(OFF(71)); break;
    STORAGE(OFF(72)); break;    STORAGE(OFF(73)); break;
    STORAGE(OFF(74)); break;    STORAGE(OFF(75)); break;
    STORAGE(OFF(76)); break;    STORAGE(OFF(77)); break;
    STORAGE(OFF(78)); break;    STORAGE(OFF(79)); break;
    STORAGE(OFF(80)); break;    STORAGE(OFF(81)); break;
    STORAGE(OFF(82)); break;    STORAGE(OFF(83)); break;
    STORAGE(OFF(84)); break;    STORAGE(OFF(85)); break;
    STORAGE(OFF(86)); break;    STORAGE(OFF(87)); break;
    STORAGE(OFF(88)); break;    STORAGE(OFF(89)); break;
    STORAGE(OFF(90)); break;    STORAGE(OFF(91)); break;
    STORAGE(OFF(92)); break;    STORAGE(OFF(93)); break;
    STORAGE(OFF(94)); break;    STORAGE(OFF(95)); break;
    STORAGE(OFF(96)); break;    STORAGE(OFF(97)); break;
    STORAGE(OFF(98)); break;    STORAGE(OFF(99)); break;
    STORAGE(OFF(100)); break;   STORAGE(OFF(101)); break;
    STORAGE(OFF(102)); break;   STORAGE(OFF(103)); break;
    STORAGE(OFF(104)); break;   STORAGE(OFF(105)); break;
    STORAGE(OFF(106)); break;   STORAGE(OFF(107)); break;
    STORAGE(OFF(108)); break;   STORAGE(OFF(109)); break;
    STORAGE(OFF(110)); break;   STORAGE(OFF(111)); break;
    STORAGE(OFF(112)); break;   STORAGE(OFF(113)); break;
    STORAGE(OFF(114)); break;   STORAGE(OFF(115)); break;
    STORAGE(OFF(116)); break;   STORAGE(OFF(117)); break;
    STORAGE(OFF(118)); break;   STORAGE(OFF(119)); break;
    STORAGE(OFF(120)); break;   STORAGE(OFF(121)); break;
    STORAGE(OFF(122)); break;   STORAGE(OFF(123)); break;
    STORAGE(OFF(124)); break;   STORAGE(OFF(125)); break;
    STORAGE(OFF(126)); break;   STORAGE(OFF(127)); break;
    STORAGE(OFF(128)); break;   STORAGE(OFF(129)); break;
    STORAGE(OFF(130)); break;   STORAGE(OFF(131)); break;
    STORAGE(OFF(132)); break;   STORAGE(OFF(133)); break;
    STORAGE(OFF(134)); break;   STORAGE(OFF(135)); break;
    STORAGE(OFF(136)); break;   STORAGE(OFF(137)); break;
    STORAGE(OFF(138)); break;   STORAGE(OFF(139)); break;
    STORAGE(OFF(140)); break;   STORAGE(OFF(141)); break;
    STORAGE(OFF(142)); break;   STORAGE(OFF(143)); break;
    STORAGE(OFF(144)); break;   STORAGE(OFF(145)); break;
    STORAGE(OFF(146)); break;   STORAGE(OFF(147)); break;
    STORAGE(OFF(148)); break;   STORAGE(OFF(149)); break;
    STORAGE(OFF(150)); break;   STORAGE(OFF(151)); break;
    STORAGE(OFF(152)); break;   STORAGE(OFF(153)); break;
    STORAGE(OFF(154)); break;   STORAGE(OFF(155)); break;
    STORAGE(OFF(156)); break;   STORAGE(OFF(157)); break;
    STORAGE(OFF(158)); break;   STORAGE(OFF(159)); break;
    STORAGE(OFF(160)); break;   STORAGE(OFF(161)); break;
    STORAGE(OFF(162)); break;   STORAGE(OFF(163)); break;
    STORAGE(OFF(164)); break;   STORAGE(OFF(165)); break;
    STORAGE(OFF(166)); break;   STORAGE(OFF(167)); break;
    STORAGE(OFF(168)); break;   STORAGE(OFF(169)); break;
    STORAGE(OFF(170)); break;   STORAGE(OFF(171)); break;
    STORAGE(OFF(172)); break;   STORAGE(OFF(173)); break;
    STORAGE(OFF(174)); break;   STORAGE(OFF(175)); break;
    STORAGE(OFF(176)); break;   STORAGE(OFF(177)); break;
    STORAGE(OFF(178)); break;   STORAGE(OFF(179)); break;
    STORAGE(OFF(180)); break;   STORAGE(OFF(181)); break;
    STORAGE(OFF(182)); break;   STORAGE(OFF(183)); break;
    STORAGE(OFF(184)); break;   STORAGE(OFF(185)); break;
    STORAGE(OFF(186)); break;   STORAGE(OFF(187)); break;
    STORAGE(OFF(188)); break;   STORAGE(OFF(189)); break;
    STORAGE(OFF(190)); break;

    /*-------------------------------------------------------------------------
     * Prefetch controller.
     */
    WRITEOP(PRECON); return;    // Prefetch Control
    WRITEOP(PRESTAT); return;   // Prefetch Status

    /*-------------------------------------------------------------------------
     * System controller.
     */
    STORAGE(CFGCON);            // Configuration Control
        // TODO: use unlock sequence
        mask = PIC32_CFGCON_DMAPRI | PIC32_CFGCON_CPUPRI |
            PIC32_CFGCON_ICACLK | PIC32_CFGCON_OCACLK |
            PIC32_CFGCON_IOLOCK | PIC32_CFGCON_PMDLOCK |
            PIC32_CFGCON_PGLOCK | PIC32_CFGCON_USBSSEN |
            PIC32_CFGCON_ECC_MASK | PIC32_CFGCON_JTAGEN |
            PIC32_CFGCON_TROEN | PIC32_CFGCON_TDOEN;
        data = (data & mask) | (*bufp & ~mask);
        break;
    READONLY(DEVID);            // Device Identifier
    STORAGE(SYSKEY);            // System Key
        /* Unlock state machine. */
        if (s->syskey_unlock == 0 && VALUE(SYSKEY) == 0xaa996655)
            s->syskey_unlock = 1;
        if (s->syskey_unlock == 1 && VALUE(SYSKEY) == 0x556699aa)
            s->syskey_unlock = 2;
        else
            s->syskey_unlock = 0;
        break;
    STORAGE(RCON); break;       // Reset Control
    WRITEOP(RSWRST);            // Software Reset
        if (s->syskey_unlock == 2 && (VALUE(RSWRST) & 1)) {
            /* Reset CPU. */
            qemu_system_reset_request();

