sergev/qemu/hw/mips/mips_pic32mz.c
    WRITEOP(ANSELE); return;        // Port E: analog select
    WRITEOP(TRISE); return;         // Port E: mask of inputs
    WRITEOPX(PORTE, LATE);          // Port E: write outputs
    WRITEOP(LATE);                  // Port E: write outputs
        pic32_gpio_write(s, 4, VALUE(LATE));
        return;
    WRITEOP(ODCE); return;          // Port E: open drain configuration
    WRITEOP(CNPUE); return;         // Input pin pull-up
    WRITEOP(CNPDE); return;         // Input pin pull-down
    WRITEOP(CNCONE); return;        // Interrupt-on-change control
    WRITEOP(CNENE); return;         // Input change interrupt enable
    WRITEOP(CNSTATE); return;       // Input change status

    WRITEOP(ANSELF); return;        // Port F: analog select
    WRITEOP(TRISF); return;         // Port F: mask of inputs
    WRITEOPX(PORTF, LATF);          // Port F: write outputs
    WRITEOP(LATF);                  // Port F: write outputs
        pic32_gpio_write(s, 5, VALUE(LATF));
        return;
    WRITEOP(ODCF); return;          // Port F: open drain configuration
    WRITEOP(CNPUF); return;         // Input pin pull-up
    WRITEOP(CNPDF); return;         // Input pin pull-down
    WRITEOP(CNCONF); return;        // Interrupt-on-change control
    WRITEOP(CNENF); return;         // Input change interrupt enable
    WRITEOP(CNSTATF); return;       // Input change status

    WRITEOP(ANSELG); return;        // Port G: analog select
    WRITEOP(TRISG); return;         // Port G: mask of inputs
    WRITEOPX(PORTG, LATG);          // Port G: write outputs
    WRITEOP(LATG);                  // Port G: write outputs
        pic32_gpio_write(s, 6, VALUE(LATG));
        return;
    WRITEOP(ODCG); return;          // Port G: open drain configuration
    WRITEOP(CNPUG); return;         // Input pin pull-up
    WRITEOP(CNPDG); return;         // Input pin pull-down
    WRITEOP(CNCONG); return;        // Interrupt-on-change control
    WRITEOP(CNENG); return;         // Input change interrupt enable
    WRITEOP(CNSTATG); return;       // Input change status

    WRITEOP(ANSELH); return;        // Port H: analog select
    WRITEOP(TRISH); return;         // Port H: mask of inputs
    WRITEOPX(PORTH, LATH);          // Port H: write outputs
    WRITEOP(LATH);                  // Port H: write outputs
        pic32_gpio_write(s, 7, VALUE(LATH));
        return;
    WRITEOP(ODCH); return;          // Port H: open drain configuration
    WRITEOP(CNPUH); return;         // Input pin pull-up
    WRITEOP(CNPDH); return;         // Input pin pull-down
    WRITEOP(CNCONH); return;        // Interrupt-on-change control
    WRITEOP(CNENH); return;         // Input change interrupt enable
    WRITEOP(CNSTATH); return;       // Input change status

    WRITEOP(ANSELJ); return;        // Port J: analog select
    WRITEOP(TRISJ); return;         // Port J: mask of inputs
    WRITEOPX(PORTJ, LATJ);          // Port J: write outputs
    WRITEOP(LATJ);                  // Port J: write outputs
        pic32_gpio_write(s, 8, VALUE(LATJ));
        return;
    WRITEOP(ODCJ); return;          // Port J: open drain configuration
    WRITEOP(CNPUJ); return;         // Input pin pull-up
    WRITEOP(CNPDJ); return;         // Input pin pull-down
    WRITEOP(CNCONJ); return;        // Interrupt-on-change control
    WRITEOP(CNENJ); return;         // Input change interrupt enable
    WRITEOP(CNSTATJ); return;       // Input change status

    WRITEOP(TRISK); return;         // Port K: mask of inputs
    WRITEOPX(PORTK, LATK);          // Port K: write outputs
    WRITEOP(LATK);                  // Port K: write outputs
        pic32_gpio_write(s, 9, VALUE(LATK));
        return;
    WRITEOP(ODCK); return;          // Port K: open drain configuration
    WRITEOP(CNPUK); return;         // Input pin pull-up
    WRITEOP(CNPDK); return;         // Input pin pull-down
    WRITEOP(CNCONK); return;        // Interrupt-on-change control
    WRITEOP(CNENK); return;         // Input change interrupt enable
    WRITEOP(CNSTATK); return;       // Input change status

    /*-------------------------------------------------------------------------
     * UART 1.
     */
    STORAGE(U1TXREG);                               // Transmit
        pic32_uart_put_char(s, 0, data);
        break;
    WRITEOP(U1MODE);                                // Mode
        pic32_uart_update_mode(s, 0);
        return;
    WRITEOPR(U1STA,                                 // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        pic32_uart_update_status(s, 0);
        return;
    WRITEOP(U1BRG); return;                         // Baud rate
    READONLY(U1RXREG);                              // Receive

    /*-------------------------------------------------------------------------
     * UART 2.
     */
    STORAGE(U2TXREG);                               // Transmit
        pic32_uart_put_char(s, 1, data);
        break;
    WRITEOP(U2MODE);                                // Mode
        pic32_uart_update_mode(s, 1);
        return;
    WRITEOPR(U2STA,                                 // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        pic32_uart_update_status(s, 1);
        return;
    WRITEOP(U2BRG); return;                         // Baud rate
    READONLY(U2RXREG);                              // Receive

    /*-------------------------------------------------------------------------
     * UART 3.
     */
    STORAGE(U3TXREG);                               // Transmit
        pic32_uart_put_char(s, 2, data);
        break;
    WRITEOP(U3MODE);                                // Mode
        pic32_uart_update_mode(s, 2);
        return;
    WRITEOPR(U3STA,                                 // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        pic32_uart_update_status(s, 2);
        return;
    WRITEOP(U3BRG); return;                         // Baud rate
    READONLY(U3RXREG);                              // Receive

    /*-------------------------------------------------------------------------
     * UART 4.
     */
    STORAGE(U4TXREG);                               // Transmit
        pic32_uart_put_char(s, 3, data);
        break;
    WRITEOP(U4MODE);                                // Mode
        pic32_uart_update_mode(s, 3);
        return;
    WRITEOPR(U4STA,                                 // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        pic32_uart_update_status(s, 3);
        return;
    WRITEOP(U4BRG); return;                         // Baud rate
    READONLY(U4RXREG);                              // Receive

    /*-------------------------------------------------------------------------
     * UART 5.
     */
    STORAGE(U5TXREG);                               // Transmit
        pic32_uart_put_char(s, 4, data);
        break;
    WRITEOP(U5MODE);                                // Mode
        pic32_uart_update_mode(s, 4);
        return;
    WRITEOPR(U5STA,                                 // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        pic32_uart_update_status(s, 4);
        return;
    WRITEOP(U5BRG); return;                         // Baud rate
    READONLY(U5RXREG);                              // Receive

    /*-------------------------------------------------------------------------
     * UART 6.
     */
    STORAGE(U6TXREG);                               // Transmit
        pic32_uart_put_char(s, 5, data);
        break;
    WRITEOP(U6MODE);                                // Mode
        pic32_uart_update_mode(s, 5);
        return;
    WRITEOPR(U6STA,                                 // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        pic32_uart_update_status(s, 5);
        return;
    WRITEOP(U6BRG); return;                         // Baud rate
    READONLY(U6RXREG);                              // Receive

    /*-------------------------------------------------------------------------
     * SPI.
     */
    WRITEOP(SPI1CON);                               // Control
        pic32_spi_control(s, 0);
        return;
    WRITEOPR(SPI1STAT, ~PIC32_SPISTAT_SPIROV);      // Status
        return;                                     // Only ROV bit is writable
    STORAGE(SPI1BUF);                               // Buffer
        pic32_spi_writebuf(s, 0, data);
        return;
    WRITEOP(SPI1BRG); return;                       // Baud rate
    WRITEOP(SPI1CON2); return;                      // Control 2

