sergev/qemu/hw/mips/mips_pic32mz.c
    WRITEOP(SPI2CON);                               // Control
        pic32_spi_control(s, 1);
        return;
    WRITEOPR(SPI2STAT, ~PIC32_SPISTAT_SPIROV);      // Status
        return;                                     // Only ROV bit is writable
    STORAGE(SPI2BUF);                               // Buffer
        pic32_spi_writebuf(s, 1, data);
        return;
    WRITEOP(SPI2BRG); return;                       // Baud rate
    WRITEOP(SPI2CON2); return;                      // Control 2

    WRITEOP(SPI3CON);                               // Control
        pic32_spi_control(s, 2);
        return;
    WRITEOPR(SPI3STAT, ~PIC32_SPISTAT_SPIROV);      // Status
        return;                                     // Only ROV bit is writable
    STORAGE(SPI3BUF);                               // Buffer
        pic32_spi_writebuf(s, 2, data);
        return;
    WRITEOP(SPI3BRG); return;                       // Baud rate
    WRITEOP(SPI3CON2); return;                      // Control 2

    WRITEOP(SPI4CON);                               // Control
        pic32_spi_control(s, 3);
        return;
    WRITEOPR(SPI4STAT, ~PIC32_SPISTAT_SPIROV);      // Status
        return;                                     // Only ROV bit is writable
    STORAGE(SPI4BUF);                               // Buffer
        pic32_spi_writebuf(s, 3, data);
        return;
    WRITEOP(SPI4BRG); return;                       // Baud rate
    WRITEOP(SPI4CON2); return;                      // Control 2

    /*
     * Timers 1-9.
     */
    WRITEOP(T1CON); return;
    WRITEOP(TMR1); return;
    WRITEOP(PR1); return;
    WRITEOP(T2CON); return;
    WRITEOP(TMR2); return;
    WRITEOP(PR2); return;
    WRITEOP(T3CON); return;
    WRITEOP(TMR3); return;
    WRITEOP(PR3); return;
    WRITEOP(T4CON); return;
    WRITEOP(TMR4); return;
    WRITEOP(PR4); return;
    WRITEOP(T5CON); return;
    WRITEOP(TMR5); return;
    WRITEOP(PR5); return;
    WRITEOP(T6CON); return;
    WRITEOP(TMR6); return;
    WRITEOP(PR6); return;
    WRITEOP(T7CON); return;
    WRITEOP(TMR7); return;
    WRITEOP(PR7); return;
    WRITEOP(T8CON); return;
    WRITEOP(TMR8); return;
    WRITEOP(PR8); return;
    WRITEOP(T9CON); return;
    WRITEOP(TMR9); return;
    WRITEOP(PR9); return;

    /*-------------------------------------------------------------------------
     * Ethernet.
     */
    WRITEOP(ETHCON1);                   // Control 1
        pic32_eth_control(s);
        return;
    WRITEOP(ETHCON2); return;           // Control 2: RX data buffer size
    WRITEOP(ETHTXST); return;           // Tx descriptor start address
    WRITEOP(ETHRXST); return;           // Rx descriptor start address
    WRITEOP(ETHHT0); return;            // Hash tasble 0
    WRITEOP(ETHHT1); return;            // Hash tasble 1
    WRITEOP(ETHPMM0); return;           // Pattern match mask 0
    WRITEOP(ETHPMM1); return;           // Pattern match mask 1
    WRITEOP(ETHPMCS); return;           // Pattern match checksum
    WRITEOP(ETHPMO); return;            // Pattern match offset
    WRITEOP(ETHRXFC); return;           // Receive filter configuration
    WRITEOP(ETHRXWM); return;           // Receive watermarks
    WRITEOP(ETHIEN); return;            // Interrupt enable
    WRITEOP(ETHIRQ); return;            // Interrupt request
    STORAGE(ETHSTAT); break;            // Status
    WRITEOP(ETHRXOVFLOW); return;       // Receive overflow statistics
    WRITEOP(ETHFRMTXOK); return;        // Frames transmitted OK statistics
    WRITEOP(ETHSCOLFRM); return;        // Single collision frames statistics
    WRITEOP(ETHMCOLFRM); return;        // Multiple collision frames statistics
    WRITEOP(ETHFRMRXOK); return;        // Frames received OK statistics
    WRITEOP(ETHFCSERR); return;         // Frame check sequence error statistics
    WRITEOP(ETHALGNERR); return;        // Alignment errors statistics
    WRITEOP(EMAC1CFG1); return;         // MAC configuration 1
    WRITEOP(EMAC1CFG2); return;         // MAC configuration 2
    WRITEOP(EMAC1IPGT); return;         // MAC back-to-back interpacket gap
    WRITEOP(EMAC1IPGR); return;         // MAC non-back-to-back interpacket gap
    WRITEOP(EMAC1CLRT); return;         // MAC collision window/retry limit
    WRITEOP(EMAC1MAXF); return;         // MAC maximum frame length
    WRITEOP(EMAC1SUPP); return;         // MAC PHY support
    WRITEOP(EMAC1TEST); return;         // MAC test
    WRITEOP(EMAC1MCFG); return;         // MII configuration
    WRITEOP(EMAC1MCMD);                 // MII command
        pic32_mii_command(s);
        return;
    WRITEOP(EMAC1MADR); return;         // MII address
    WRITEOP(EMAC1MWTD);                 // MII write data
        pic32_mii_write(s);
        return;
    WRITEOP(EMAC1MRDD); return;         // MII read data
    WRITEOP(EMAC1MIND); return;         // MII indicators
    WRITEOP(EMAC1SA0); return;          // MAC station address 0
    WRITEOP(EMAC1SA1); return;          // MAC station address 1
    WRITEOP(EMAC1SA2); return;          // MAC station address 2

    /*-------------------------------------------------------------------------
     * USB.
     */
    STORAGE(USBCSR0); break;
    STORAGE(USBCSR1); break;
    STORAGE(USBCSR2); break;
    STORAGE(USBCSR3); break;
    STORAGE(USBIENCSR0); break;
    STORAGE(USBIENCSR1); break;
    STORAGE(USBIENCSR2); break;
    STORAGE(USBIENCSR3); break;
    STORAGE(USBFIFO0); break;
    STORAGE(USBFIFO1); break;
    STORAGE(USBFIFO2); break;
    STORAGE(USBFIFO3); break;
    STORAGE(USBFIFO4); break;
    STORAGE(USBFIFO5); break;
    STORAGE(USBFIFO6); break;
    STORAGE(USBFIFO7); break;
    STORAGE(USBOTG); break;
    STORAGE(USBFIFOA); break;
    STORAGE(USBHWVER); break;
    STORAGE(USBINFO); break;
    STORAGE(USBEOFRST); break;
    STORAGE(USBE0TXA); break;
    STORAGE(USBE0RXA); break;
    STORAGE(USBE1TXA); break;
    STORAGE(USBE1RXA); break;
    STORAGE(USBE2TXA); break;
    STORAGE(USBE2RXA); break;
    STORAGE(USBE3TXA); break;
    STORAGE(USBE3RXA); break;
    STORAGE(USBE4TXA); break;
    STORAGE(USBE4RXA); break;
    STORAGE(USBE5TXA); break;
    STORAGE(USBE5RXA); break;
    STORAGE(USBE6TXA); break;
    STORAGE(USBE6RXA); break;
    STORAGE(USBE7TXA); break;
    STORAGE(USBE7RXA); break;
    STORAGE(USBE0CSR0); break;
    STORAGE(USBE0CSR2); break;
    STORAGE(USBE0CSR3); break;
    STORAGE(USBE1CSR0); break;
    STORAGE(USBE1CSR1); break;
    STORAGE(USBE1CSR2); break;
    STORAGE(USBE1CSR3); break;
    STORAGE(USBE2CSR0); break;
    STORAGE(USBE2CSR1); break;
    STORAGE(USBE2CSR2); break;
    STORAGE(USBE2CSR3); break;
    STORAGE(USBE3CSR0); break;
    STORAGE(USBE3CSR1); break;
    STORAGE(USBE3CSR2); break;
    STORAGE(USBE3CSR3); break;
    STORAGE(USBE4CSR0); break;
    STORAGE(USBE4CSR1); break;
    STORAGE(USBE4CSR2); break;
    STORAGE(USBE4CSR3); break;
    STORAGE(USBE5CSR0); break;
    STORAGE(USBE5CSR1); break;
    STORAGE(USBE5CSR2); break;
    STORAGE(USBE5CSR3); break;
    STORAGE(USBE6CSR0); break;
    STORAGE(USBE6CSR1); break;
    STORAGE(USBE6CSR2); break;
    STORAGE(USBE6CSR3); break;
    STORAGE(USBE7CSR0); break;
    STORAGE(USBE7CSR1); break;
    STORAGE(USBE7CSR2); break;
    STORAGE(USBE7CSR3); break;
    STORAGE(USBDMAINT); break;
    STORAGE(USBDMA1C); break;
    STORAGE(USBDMA1A); break;
    STORAGE(USBDMA1N); break;
    STORAGE(USBDMA2C); break;
    STORAGE(USBDMA2A); break;
    STORAGE(USBDMA2N); break;
    STORAGE(USBDMA3C); break;
    STORAGE(USBDMA3A); break;
    STORAGE(USBDMA3N); break;
    STORAGE(USBDMA4C); break;
    STORAGE(USBDMA4A); break;
    STORAGE(USBDMA4N); break;
    STORAGE(USBDMA5C); break;
    STORAGE(USBDMA5A); break;
    STORAGE(USBDMA5N); break;
    STORAGE(USBDMA6C); break;
    STORAGE(USBDMA6A); break;
    STORAGE(USBDMA6N); break;
    STORAGE(USBDMA7C); break;
    STORAGE(USBDMA7A); break;
    STORAGE(USBDMA7N); break;
    STORAGE(USBDMA8C); break;
    STORAGE(USBDMA8A); break;
    STORAGE(USBDMA8N); break;
    STORAGE(USBE1RPC); break;
    STORAGE(USBE2RPC); break;
    STORAGE(USBE3RPC); break;
    STORAGE(USBE4RPC); break;
    STORAGE(USBE5RPC); break;
    STORAGE(USBE6RPC); break;
    STORAGE(USBE7RPC); break;
    STORAGE(USBDPBFD); break;
    STORAGE(USBTMCON1); break;
    STORAGE(USBTMCON2); break;
    STORAGE(USBLPMR1); break;
    STORAGE(USBLMPR2); break;

    default:
        printf("--- Write %08x to 1f8%05x: peripheral register not supported\n",
            data, offset);
        if (TRACE)
            fprintf(qemu_logfile, "--- Write %08x to 1f8%05x: peripheral register not supported\n",
                data, offset);
        exit(1);
readonly:
        printf("--- Write %08x to %s: readonly register\n",
            data, *namep);
        if (TRACE)
            fprintf(qemu_logfile, "--- Write %08x to %s: readonly register\n",
                data, *namep);
        *namep = 0;
        return;
    }
    *bufp = data;
}

