sergev/qemu/hw/mips/mips_pic32mz.c
    /* CPU runs at 200MHz.
     * Count register increases at half this rate. */
    cpu_mips_clock_init(env, 100*1000*1000);

    /*
     * Initialize board-specific parameters.
     */
    int cs0_port, cs0_pin, cs1_port, cs1_pin;
    switch (board_type) {
    default:
    case BOARD_WIFIRE:                      // console on UART4
        BOOTMEM(DEVCFG0) = 0xfffffff7;
        BOOTMEM(DEVCFG1) = 0x7f743cb9;
        BOOTMEM(DEVCFG2) = 0xfff9b11a;
        BOOTMEM(DEVCFG3) = 0xbeffffff;
        VALUE(DEVID)     = 0x4510e053;      // MZ2048ECG100 rev A4
        VALUE(OSCCON)    = 0x00001120;      // external oscillator 24MHz
        s->sdcard_spi_port = 2;             // SD card at SPI3,
        cs0_port = 2;  cs0_pin = 3;         // select0 at C3,
        cs1_port = -1; cs1_pin = -1;        // select1 not available
        break;
    case BOARD_MEBII:                       // console on UART1
        BOOTMEM(DEVCFG0) = 0x7fffffdb;
        BOOTMEM(DEVCFG1) = 0x0000fc81;
        BOOTMEM(DEVCFG2) = 0x3ff8b11a;
        BOOTMEM(DEVCFG3) = 0x86ffffff;
        VALUE(DEVID)     = 0x45127053;      // MZ2048ECH144 rev A4
        VALUE(OSCCON)    = 0x00001120;      // external oscillator 24MHz
        s->sdcard_spi_port = 1;             // SD card at SPI2,
        cs0_port = 1;  cs0_pin = 14;        // select0 at B14,
        cs1_port = -1; cs1_pin = -1;        // select1 not available
        break;
    case BOARD_EXPLORER16:                  // console on UART1
        BOOTMEM(DEVCFG0) = 0x7fffffdb;
        BOOTMEM(DEVCFG1) = 0x0000fc81;
        BOOTMEM(DEVCFG2) = 0x3ff8b11a;
        BOOTMEM(DEVCFG3) = 0x86ffffff;
        VALUE(DEVID)     = 0x35113053;      // MZ2048ECH100 rev A3
        VALUE(OSCCON)    = 0x00001120;      // external oscillator 24MHz
        s->sdcard_spi_port = 0;             // SD card at SPI1,
        cs0_port = 1;  cs0_pin = 1;         // select0 at B1,
        cs1_port = 1;  cs1_pin = 2;         // select1 at B2
        break;
    }

    /* UARTs */
    pic32_uart_init(s, 0, PIC32_IRQ_U1E, U1STA, U1MODE);
    pic32_uart_init(s, 1, PIC32_IRQ_U2E, U2STA, U2MODE);
    pic32_uart_init(s, 2, PIC32_IRQ_U3E, U3STA, U3MODE);
    pic32_uart_init(s, 3, PIC32_IRQ_U4E, U4STA, U4MODE);
    pic32_uart_init(s, 4, PIC32_IRQ_U5E, U5STA, U5MODE);
    pic32_uart_init(s, 5, PIC32_IRQ_U6E, U6STA, U6MODE);

    /* SPIs */
    pic32_spi_init(s, 0, PIC32_IRQ_SPI1E, SPI1CON, SPI1STAT);
    pic32_spi_init(s, 1, PIC32_IRQ_SPI2E, SPI2CON, SPI2STAT);
    pic32_spi_init(s, 2, PIC32_IRQ_SPI3E, SPI3CON, SPI3STAT);
    pic32_spi_init(s, 3, PIC32_IRQ_SPI4E, SPI4CON, SPI4STAT);
    pic32_spi_init(s, 4, PIC32_IRQ_SPI5E, SPI5CON, SPI5STAT);
    pic32_spi_init(s, 5, PIC32_IRQ_SPI6E, SPI6CON, SPI6STAT);

    /*
     * Load SD card images.
     * Use options:
     *      -sd filename
     * or   -hda filename
     * and  -hdb filename
     */
    const char *sd0_file = 0, *sd1_file = 0;
    DriveInfo *dinfo = drive_get(IF_IDE, 0, 0);
    if (dinfo) {
        sd0_file = qemu_opt_get(dinfo->opts, "file");
        dinfo->is_default = 1;

        dinfo = drive_get(IF_IDE, 0, 1);
        if (dinfo) {
            sd1_file = qemu_opt_get(dinfo->opts, "file");
            dinfo->is_default = 1;
        }
    }
    if (! sd0_file) {
        dinfo = drive_get(IF_SD, 0, 0);
        if (dinfo) {
            sd0_file = qemu_opt_get(dinfo->opts, "file");
            dinfo->is_default = 1;
        }
    }
    pic32_sdcard_init(s, 0, "sd0", sd0_file, cs0_port, cs0_pin);
    pic32_sdcard_init(s, 1, "sd1", sd1_file, cs1_port, cs1_pin);

    /* Ethernet. */
    if (nd_table[0].used)
        pic32_eth_init(s, &nd_table[0]);

    io_reset(s);
    pic32_sdcard_reset(s);
    pic32_pass_signal_chars();
}

static void pic32_init_wifire(MachineState *machine)
{
    pic32_init(machine, BOARD_WIFIRE);
}

static void pic32_init_meb2(MachineState *machine)
{
    pic32_init(machine, BOARD_MEBII);
}

static void pic32_init_explorer16(MachineState *machine)
{
    pic32_init(machine, BOARD_EXPLORER16);
}

static int pic32_sysbus_device_init(SysBusDevice *sysbusdev)
{
    return 0;
}

static void pic32_class_init(ObjectClass *klass, void *data)
{
    SysBusDeviceClass *k = SYS_BUS_DEVICE_CLASS(klass);

    k->init = pic32_sysbus_device_init;
}

static const TypeInfo pic32_device = {
    .name          = TYPE_MIPS_PIC32,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(pic32_t),
    .class_init    = pic32_class_init,
};

static void pic32_register_types(void)
{
    type_register_static(&pic32_device);
}

static QEMUMachine pic32_board[3] = {
    {
        .name       = "pic32mz-wifire",
        .desc       = "PIC32MZ microcontroller on chipKIT WiFire board",
        .init       = pic32_init_wifire,
        .max_cpus   = 1,
    },
    {
        .name       = "pic32mz-meb2",
        .desc       = "PIC32MZ microcontroller on Microchip MEB-II board",
        .init       = pic32_init_meb2,
        .max_cpus   = 1,
    },
    {
        .name       = "pic32mz-explorer16",
        .desc       = "PIC32MZ microcontroller on Microchip Explorer-16 board",
        .init       = pic32_init_explorer16,
        .max_cpus   = 1,
    },
};

static void pic32_machine_init(void)
{
    qemu_register_machine(&pic32_board[0]);
    qemu_register_machine(&pic32_board[1]);
    qemu_register_machine(&pic32_board[2]);
}

type_init(pic32_register_types)
machine_init(pic32_machine_init);

#endif /* !TARGET_MIPS64 && !TARGET_WORDS_BIGENDIAN */
